{
  "meals": [
    {
      "name": "Mediterranean Chickpea Salad Wrap",
      "type": "lunch",
      "ingredients": [
        "1 can chickpeas, drained and rinsed",
        "1 medium cucumber, diced",
        "1 small red bell pepper, diced",
        "1/2 cup cherry tomatoes, halved",
        "1/4 cup red onion, finely chopped",
        "1/4 cup kalamata olives, pitted and sliced",
        "1/4 cup feta cheese, crumbled",
        "1 tablespoon extra virgin olive oil",
        "1 tablespoon lemon juice",
        "1 teaspoon dried oregano",
        "Salt and pepper to taste",
        "4 whole wheat tortillas",
        "Fresh parsley, chopped for garnish"
      ],
      "prepTime": "15 minutes",
      "calories": "400-450",
      "description": "A refreshing and satisfying Mediterranean-inspired wrap packed with protein, fiber, and healthy fats.",
      "instructions": [
        "In a large bowl, combine chickpeas, cucumber, red bell pepper, cherry tomatoes, red onion, and kalamata olives.",
        "Add feta cheese, extra virgin olive oil, lemon juice, dried oregano, salt, and pepper. Mix well to combine.",
        "Warm the tortillas slightly in a microwave or on a dry skillet for a few seconds.",
        "Divide the chickpea salad evenly among the tortillas, roll them up, and garnish with chopped parsley.",
        "Slice the wraps in half if desired and enjoy immediately."
      ],
      "nutritionNotes": "This meal is rich in plant-based protein from chickpeas, healthy fats from olive oil and olives, and vitamins and minerals from fresh vegetables. It's also high in fiber, supporting digestive health and keeping you full longer. The use of whole wheat tortillas adds whole grains for sustained energy.",
      "generatedAt": "2025-07-03T18:48:10.826Z",
      "id": "1751568490826",
      "isAIGenerated": true
    },
    {
      "name": "Berry Almond Overnight Oats",
      "type": "breakfast",
      "ingredients": [
        "1/2 cup rolled oats",
        "1/2 cup almond milk (or any milk of choice)",
        "1/2 cup Greek yogurt",
        "1 tablespoon chia seeds",
        "1/2 teaspoon vanilla extract",
        "1 tablespoon honey or maple syrup",
        "1/2 cup mixed seasonal berries (e.g., strawberries, blueberries, raspberries)",
        "1 tablespoon sliced almonds"
      ],
      "prepTime": "5 minutes",
      "calories": "350-400",
      "description": "A refreshing and energizing start to your day with creamy oats, fresh berries, and crunchy almonds.",
      "instructions": [
        "In a jar or bowl, combine the rolled oats, almond milk, Greek yogurt, chia seeds, vanilla extract, and sweetener.",
        "Stir well to mix, then cover and refrigerate overnight.",
        "In the morning, give the oats a good stir. If too thick, add a splash of milk.",
        "Top with fresh mixed berries and sliced almonds before serving."
      ],
      "nutritionNotes": "This meal provides a balance of protein, healthy fats, and fiber to keep you full and energized throughout the morning. Chia seeds and Greek yogurt add a protein boost, while berries offer antioxidants and vitamins.",
      "generatedAt": "2025-07-04T11:01:57.909Z",
      "id": "1751626917909",
      "isAIGenerated": true
    },
    {
      "name": "Spiced Lentil and Vegetable Soup",
      "type": "lunch",
      "ingredients": [
        "1 cup dried lentils",
        "2 carrots, diced",
        "1 onion, chopped",
        "2 celery stalks, chopped",
        "3 cloves garlic, minced",
        "1 can diced tomatoes (14.5 oz)",
        "4 cups vegetable broth",
        "1 teaspoon ground cumin",
        "1 teaspoon smoked paprika",
        "Salt and pepper to taste",
        "2 tablespoons olive oil",
        "Fresh parsley for garnish"
      ],
      "prepTime": "20 minutes",
      "calories": "300-350",
      "description": "A hearty and comforting lentil and vegetable soup seasoned with warm spices, perfect for a satisfying lunch.",
      "instructions": [
        "Heat the olive oil in a large pot over medium heat. Add the onion, carrots, and celery, and sauté until softened, about 5 minutes.",
        "Stir in the garlic, cumin, and smoked paprika, cooking for an additional minute until fragrant.",
        "Add the lentils, diced tomatoes, and vegetable broth to the pot. Bring to a boil, then reduce heat to low, cover, and simmer for 20 minutes or until lentils are tender.",
        "Season with salt and pepper to taste. Garnish with fresh parsley before serving."
      ],
      "nutritionNotes": "This meal is rich in plant-based protein from lentils, fiber from vegetables, and healthy fats from olive oil. It's balanced with carbohydrates and is perfect for sustaining energy levels throughout the day.",
      "generatedAt": "2025-07-04T16:02:14.494Z",
      "id": "1751644934494",
      "isAIGenerated": true
    }
  ],
  "lastGenerated": "2025-07-04T16:02:14.494Z"
}