{
  "meals": [
    {
      "name": "Lentil and Kale Salad with Lemon Vinaigrette",
      "type": "lunch",
      "ingredients": [
        "1 cup dry green lentils",
        "2 cups water",
        "1 bunch kale, stems removed and leaves chopped",
        "1 medium carrot, shredded",
        "1 red bell pepper, diced",
        "1/4 cup red onion, finely chopped",
        "1/4 cup feta cheese, crumbled",
        "1/4 cup sliced almonds, toasted",
        "2 tablespoons olive oil",
        "1 tablespoon lemon juice",
        "1 teaspoon Dijon mustard",
        "Salt and pepper to taste"
      ],
      "prepTime": "25 minutes",
      "calories": "350-400",
      "description": "A refreshing and nutritious Lentil and Kale Salad with a zesty Lemon Vinaigrette, perfect for an active lifestyle.",
      "instructions": [
        "Rinse lentils and cook in 2 cups of water until tender, about 15-20 minutes. Drain and let cool.",
        "In a large bowl, combine chopped kale, shredded carrot, diced red bell pepper, and chopped red onion.",
        "In a small bowl, whisk together olive oil, lemon juice, Dijon mustard, salt, and pepper to make the vinaigrette.",
        "Add cooked lentils, crumbled feta cheese, and toasted sliced almonds to the vegetable mix.",
        "Drizzle with the lemon vinaigrette and toss to combine. Adjust seasoning if needed."
      ],
      "nutritionNotes": "This meal is rich in protein from lentils and feta, provides fiber from kale and veggies, and includes healthy fats from olive oil and almonds. It's a well-balanced option that supports sustained energy and satiety.",
      "generatedAt": "2025-08-04T16:02:47.005Z",
      "id": "1754323367005",
      "isAIGenerated": true,
      "responseTimeMs": 166102
    },
    {
      "name": "Quinoa Tabbouleh with Grilled Shrimp",
      "type": "lunch",
      "ingredients": [
        "1 cup quinoa",
        "1/2 cup chopped fresh parsley",
        "1/2 cup chopped fresh mint",
        "1 medium cucumber, diced",
        "2 medium tomatoes, diced",
        "1/4 cup fresh lemon juice",
        "3 tablespoons olive oil",
        "Salt and pepper to taste",
        "1 lb large shrimp, peeled and deveined",
        "1 teaspoon garlic powder",
        "1 teaspoon paprika"
      ],
      "prepTime": "30 minutes",
      "calories": "400-500",
      "description": "A refreshing and zesty quinoa tabbouleh paired with perfectly grilled shrimp, this light and nutritious lunch is both energizing and satisfying.",
      "instructions": [
        "Cook quinoa according to package instructions, then let it cool.",
        "In a large bowl, combine cooked quinoa, parsley, mint, cucumber, and tomatoes.",
        "Whisk together lemon juice, olive oil, salt, and pepper, then pour over quinoa mixture to dress.",
        "Season shrimp with garlic powder, paprika, salt, and pepper.",
        "Grill shrimp over medium-high heat for about 2-3 minutes per side or until cooked through.",
        "Serve shrimp on top of the quinoa tabbouleh and enjoy."
      ],
      "nutritionNotes": "This meal offers a great balance of lean protein from the shrimp, complex carbohydrates from quinoa, and essential vitamins and minerals from fresh herbs and vegetables. It's light enough for lunch but provides lasting energy for an active lifestyle.",
      "generatedAt": "2025-08-05T16:02:50.153Z",
      "id": "1754409770153",
      "isAIGenerated": true,
      "responseTimeMs": 169738
    },
    {
      "name": "Turkey and Apple Lentil Stew",
      "type": "lunch",
      "ingredients": [
        "1 cup dried lentils",
        "2 cups chicken or vegetable broth",
        "1 cup diced turkey breast",
        "1 medium apple, diced",
        "1 medium carrot, diced",
        "1 celery stalk, diced",
        "1 small onion, diced",
        "2 cloves garlic, minced",
        "1 tsp dried thyme",
        "1 tsp dried rosemary",
        "Salt and pepper to taste",
        "1 tbsp olive oil",
        "1/2 cup fresh parsley, chopped"
      ],
      "prepTime": "30 minutes",
      "calories": "350-400 per serving",
      "description": "A hearty yet balanced stew combining lean turkey, nutritious lentils, and crisp apples for a satisfying midday meal.",
      "instructions": [
        "In a large pot, heat olive oil over medium heat. Add onion, carrot, celery, and garlic, and sauté until softened, about 5 minutes.",
        "Add the diced turkey breast to the pot and cook until browned. Stir in the thyme, rosemary, salt, and pepper.",
        "Add the lentils and broth to the pot. Bring to a boil, then reduce heat and simmer, covered, for about 20 minutes.",
        "Add the diced apple and continue to simmer until lentils are tender, about 10 more minutes.",
        "Remove from heat and stir in the chopped parsley. Adjust seasoning if necessary.",
        "Serve warm and enjoy."
      ],
      "nutritionNotes": "This meal provides a good balance of protein from turkey and lentils, fiber from lentils and vegetables, and a hint of sweetness from the apple. It's heart-healthy and perfect for active lifestyles, offering sustained energy without being too heavy.",
      "generatedAt": "2025-08-06T16:02:35.478Z",
      "id": "1754496155478",
      "isAIGenerated": true,
      "responseTimeMs": 154774
    },
    {
      "name": "Roasted Sweet Potato and Black Bean Burrito Bowls",
      "type": "lunch",
      "ingredients": [
        "1 medium sweet potato, peeled and diced",
        "1 can black beans, rinsed and drained",
        "1 avocado, sliced",
        "1 cup frozen corn",
        "1 cup cooked brown rice",
        "1 lime, juiced",
        "1 tablespoon olive oil",
        "1 teaspoon ground cumin",
        "1/2 teaspoon smoked paprika",
        "Salt and pepper to taste",
        "1 cup cherry tomatoes, halved",
        "1 cup fresh spinach",
        "1/4 cup red onion, finely chopped",
        "1/4 cup cilantro, chopped"
      ],
      "prepTime": "30 minutes",
      "calories": "450-550",
      "description": "A vibrant and hearty burrito bowl packed with roasted sweet potatoes, protein-rich black beans, and fresh toppings for a balanced lunch.",
      "instructions": [
        "Preheat oven to 400°F (200°C). Toss diced sweet potatoes with olive oil, cumin, smoked paprika, salt, and pepper. Spread on a baking sheet and roast for 25 minutes, or until tender.",
        "While sweet potatoes roast, cook the frozen corn in a microwave-safe bowl for 3-4 minutes until heated through.",
        "In a skillet over medium heat, warm the black beans with a splash of lime juice and season with salt and pepper.",
        "Divide cooked brown rice between bowls. Layer with roasted sweet potatoes, warmed black beans, corn, cherry tomatoes, spinach, and avocado slices.",
        "Top with red onion, cilantro, and a drizzle of lime juice. Serve immediately."
      ],
      "nutritionNotes": "This meal is rich in fiber from the sweet potatoes and black beans, providing sustained energy and aiding digestion. The avocado offers healthy fats, while the brown rice and corn contribute whole grains for a balanced macronutrient profile. Seasonal cherry tomatoes add a burst of vitamins and antioxidants.",
      "generatedAt": "2025-08-07T16:02:59.892Z",
      "id": "1754582579892",
      "isAIGenerated": true,
      "responseTimeMs": 179766
    },
    {
      "name": "Spicy Black Bean and Corn Taco Lettuce Wraps",
      "type": "lunch",
      "ingredients": [
        "romaine lettuce leaves",
        "canned black beans",
        "canned sweet corn",
        "small red onion",
        "avocado",
        "lime juice",
        "cumin",
        "chili powder",
        "salt",
        "pepper",
        "sliced jalapeño (optional)",
        "shredded cheese (optional)",
        "sour cream (optional)"
      ],
      "prepTime": "15 minutes",
      "calories": "350-450",
      "description": "A fresh and zesty lunch option that combines the creaminess of avocado with the spiciness of black beans and corn, all wrapped in crisp lettuce.",
      "instructions": [
        "Drain and rinse the canned black beans and sweet corn.",
        "Chop the red onion and avocado, and slice the jalapeño if using.",
        "In a bowl, mix the black beans, corn, red onion, avocado, lime juice, cumin, chili powder, salt, and pepper. Adjust seasoning to taste.",
        "Use romaine lettuce leaves as taco shells, spoon the black bean and corn mixture into each leaf.",
        "Top with sliced jalapeño, shredded cheese, and a dollop of sour cream if desired.",
        "Serve immediately and enjoy your light yet satisfying lunch."
      ],
      "nutritionNotes": "This meal is rich in plant-based protein and fiber from black beans and corn, with healthy fats from avocado. It's also low in calories, making it perfect for a lighter lunch. The use of fresh vegetables ensures a good dose of vitamins and minerals, supporting an active lifestyle.",
      "generatedAt": "2025-08-08T16:03:52.112Z",
      "id": "1754669032112",
      "isAIGenerated": true,
      "responseTimeMs": 231439
    },
    {
      "name": "Asian-Inspired Tofu Stir-Fry with Brown Rice",
      "type": "lunch",
      "ingredients": [
        "1 cup brown rice",
        "1 block firm tofu",
        "1 bell pepper (any color, sliced)",
        "1 medium carrot, julienned",
        "1 cup broccoli florets",
        "2 green onions, sliced",
        "2 cloves garlic, minced",
        "1 tablespoon ginger, grated",
        "2 tablespoons low-sodium soy sauce",
        "1 tablespoon sesame oil",
        "1 tablespoon rice vinegar",
        "1 teaspoon sriracha (optional)",
        "1 tablespoon sesame seeds"
      ],
      "prepTime": "30 minutes",
      "calories": "450-500",
      "description": "A vibrant and flavorful stir-fry with tofu and seasonal vegetables, served over nutty brown rice. This meal is a perfect balance of protein, fiber, and essential nutrients to keep you energized through the afternoon.",
      "instructions": [
        "Cook the brown rice according to package instructions. Set aside once cooked.",
        "Press the tofu to remove excess moisture, then cut into 1-inch cubes. In a non-stick pan over medium heat, add 1 tablespoon of sesame oil. Add the tofu cubes and cook until golden brown, about 5-7 minutes. Remove tofu from the pan and set aside.",
        "In the same pan, add a bit more sesame oil if needed. Add garlic and ginger, sauté for 1 minute until fragrant. Add the bell pepper, carrot, and broccoli, and stir-fry for about 5 minutes until vegetables are tender-crisp.",
        "Return the tofu to the pan, add soy sauce, rice vinegar, and sriracha (if using). Stir well to coat all ingredients. Cook for another 2-3 minutes.",
        "Serve the stir-fry over brown rice, garnished with sliced green onions and sesame seeds."
      ],
      "nutritionNotes": "This dish is rich in plant-based protein from tofu, providing essential amino acids. The combination of brown rice and vegetables offers complex carbohydrates, dietary fiber, and vitamins. The use of sesame oil and soy sauce adds healthy fats and flavor without excessive calories. This meal is both filling and nutritious, supporting an active lifestyle while being easy on the budget.",
      "generatedAt": "2025-08-09T16:03:08.203Z",
      "id": "1754755388203",
      "isAIGenerated": true,
      "responseTimeMs": 187633
    },
    {
      "name": "Chickpea and Spinach Curry Wrap",
      "type": "lunch",
      "ingredients": [
        "1 can chickpeas, drained and rinsed",
        "1 cup fresh spinach",
        "1 small onion, diced",
        "1 clove garlic, minced",
        "1 tablespoon curry powder",
        "1 teaspoon ground cumin",
        "1 tablespoon olive oil",
        "1 tablespoon lemon juice",
        "Salt and pepper to taste",
        "4 whole grain tortillas",
        "1 cup shredded carrot",
        "1/2 cup cucumber, sliced"
      ],
      "prepTime": "20 minutes",
      "calories": "350-400",
      "description": "A flavorful chickpea and spinach curry wrapped in a whole grain tortilla, perfect for a satisfying and nutritious lunch.",
      "instructions": [
        "Heat olive oil in a pan over medium heat. Add onion and garlic, sauté until translucent.",
        "Add curry powder and cumin, stir for 1 minute. Add chickpeas and spinach, cook until spinach is wilted.",
        "Stir in lemon juice, salt, and pepper. Remove from heat.",
        "Warm tortillas slightly. Spread curry mixture on each tortilla, top with shredded carrot and cucumber slices.",
        "Fold the tortillas into wraps and serve."
      ],
      "nutritionNotes": "Rich in protein and fiber from chickpeas and whole grains, this meal is balanced with vitamins and minerals from spinach, carrots, and cucumber. It's heart-healthy and supports an active lifestyle.",
      "generatedAt": "2025-08-10T16:02:47.358Z",
      "id": "1754841767358",
      "isAIGenerated": true,
      "responseTimeMs": 166725
    },
    {
      "name": "Chicken and Chickpea Spinach Wrap",
      "type": "lunch",
      "ingredients": [
        "whole wheat tortillas",
        "grilled chicken breast",
        "canned chickpeas",
        "baby spinach",
        "cucumber",
        "red bell pepper",
        "feta cheese",
        "olive oil",
        "lemon juice",
        "garlic powder",
        "salt",
        "pepper"
      ],
      "prepTime": "20 minutes",
      "calories": "350-450",
      "description": "A refreshing and hearty wrap filled with lean protein, fiber-rich chickpeas, and crisp veggies, all wrapped in a whole wheat tortilla for a satisfying and balanced lunch.",
      "instructions": [
        "Grill the chicken breast seasoned with garlic powder, salt, and pepper until fully cooked. Let it rest before slicing.",
        "In a bowl, mix chickpeas, chopped cucumber, sliced red bell pepper, and crumbled feta cheese.",
        "Whisk together olive oil, lemon juice, salt, and pepper to make the dressing. Toss the chickpea mixture with the dressing.",
        "Spread baby spinach on the whole wheat tortilla, add sliced grilled chicken, and top with the chickpea salad.",
        "Wrap tightly and enjoy immediately or pack for a portable lunch."
      ],
      "nutritionNotes": "This meal offers a balance of protein from the chicken and chickpeas, healthy fats from olive oil, and fiber from chickpeas and vegetables. The inclusion of spinach and bell pepper provides essential vitamins and minerals, making it a well-rounded option for an active lifestyle.",
      "generatedAt": "2025-08-11T16:02:23.330Z",
      "id": "1754928143330",
      "isAIGenerated": true,
      "responseTimeMs": 143180
    },
    {
      "name": "Cauliflower and Chickpea Lemon Rice Bowl",
      "type": "lunch",
      "ingredients": [
        "1 cup brown rice",
        "1 head cauliflower, chopped",
        "1 can chickpeas, drained and rinsed",
        "1 lemon, juiced",
        "2 tbsp olive oil",
        "1 tsp garlic powder",
        "1 tsp smoked paprika",
        "1/2 cup cherry tomatoes, halved",
        "1 cucumber, diced",
        "1/4 cup fresh parsley, chopped",
        "Salt and pepper to taste"
      ],
      "prepTime": "30 minutes",
      "calories": "400-450",
      "description": "A refreshing and nutritious rice bowl packed with protein-rich chickpeas, tender cauliflower, and vibrant lemony dressing.",
      "instructions": [
        "Cook the brown rice according to package instructions and set aside to cool.",
        "Preheat your oven to 400°F (200°C). Toss the chopped cauliflower with olive oil, garlic powder, smoked paprika, salt, and pepper. Spread on a baking sheet and roast for 20-25 minutes until golden brown.",
        "In a large bowl, mix the cooked rice, roasted cauliflower, chickpeas, cherry tomatoes, and cucumber.",
        "Drizzle with lemon juice and olive oil, then sprinkle with fresh parsley, salt, and pepper. Toss everything together to combine.",
        "Serve warm or at room temperature."
      ],
      "nutritionNotes": "This meal provides a balanced mix of complex carbohydrates, lean protein, and healthy fats, ideal for sustained energy throughout the day. Cauliflower is a great seasonal vegetable, and chickpeas offer a budget-friendly protein source.",
      "generatedAt": "2025-08-12T16:02:23.978Z",
      "id": "1755014543978",
      "isAIGenerated": true,
      "responseTimeMs": 143482
    },
    {
      "name": "Cucumber and Hummus Veggie Wrap",
      "type": "lunch",
      "ingredients": [
        "whole wheat tortilla",
        "hummus",
        "sliced cucumber",
        "sliced bell peppers",
        "spinach leaves",
        "feta cheese",
        "olive oil",
        "lemon juice",
        "salt and pepper"
      ],
      "prepTime": "10 minutes",
      "calories": "350-400",
      "description": "A refreshing and nutritious wrap filled with crisp veggies and creamy hummus, perfect for a busy day.",
      "instructions": [
        "Spread a generous layer of hummus on a whole wheat tortilla.",
        "Layer sliced cucumber, bell peppers, and fresh spinach leaves on top.",
        "Sprinkle crumbled feta cheese over the vegetables.",
        "Drizzle with a little olive oil and lemon juice, then season with salt and pepper.",
        "Roll the tortilla tightly, slice in half, and serve."
      ],
      "nutritionNotes": "This meal offers a great balance of protein from the hummus and feta, fiber from the veggies and whole wheat tortilla, and healthy fats from the olive oil. It's light yet satisfying, making it ideal for an active lifestyle.",
      "generatedAt": "2025-08-13T16:01:56.937Z",
      "id": "1755100916937",
      "isAIGenerated": true,
      "responseTimeMs": 115940
    },
    {
      "name": "Hearty Avocado and Black Bean Salad",
      "type": "lunch",
      "ingredients": [
        "1 can black beans, rinsed and drained",
        "1 medium avocado, diced",
        "1 small red onion, finely chopped",
        "1 cup cherry tomatoes, halved",
        "1 small cucumber, diced",
        "1/2 cup corn kernels (fresh or frozen)",
        "1/4 cup fresh cilantro, chopped",
        "1 lime, juiced",
        "1 tsp ground cumin",
        "Salt and pepper to taste",
        "Optional: 1/2 cup crumbled feta cheese or shredded cheese of choice"
      ],
      "prepTime": "15 minutes",
      "calories": "350-400",
      "description": "A refreshing and satisfying salad that combines creamy avocado, protein-rich black beans, and vibrant seasonal veggies. Perfect for a busy day.",
      "instructions": [
        "In a large bowl, combine black beans, avocado, red onion, cherry tomatoes, cucumber, corn, and cilantro.",
        "In a small bowl, whisk together lime juice, cumin, salt, and pepper.",
        "Pour the dressing over the salad and gently toss to combine. Taste and adjust seasoning as needed.",
        "If using, sprinkle feta or shredded cheese over the top before serving."
      ],
      "nutritionNotes": "This salad is packed with fiber from the beans and vegetables, healthy fats from the avocado, and protein for muscle support. The lime and cumin add a zesty flavor without the need for extra calories. Ideal for a light yet energy-boosting lunch.",
      "generatedAt": "2025-08-14T16:02:21.581Z",
      "id": "1755187341581",
      "isAIGenerated": true,
      "responseTimeMs": 141246
    },
    {
      "name": "Spicy Thai Peanut Zoodle Bowl",
      "type": "lunch",
      "ingredients": [
        "2 medium zucchinis, spiralized",
        "1 cup canned chickpeas, drained and rinsed",
        "1 red bell pepper, thinly sliced",
        "1 cup baby spinach",
        "2 tablespoons peanut butter",
        "2 tablespoons soy sauce or tamari",
        "1 tablespoon lime juice",
        "1 teaspoon grated ginger",
        "1 clove garlic, minced",
        "1 teaspoon sriracha or chili sauce (optional)",
        "2 tablespoons chopped peanuts (optional, for garnish)",
        "1 tablespoon sesame seeds (optional, for garnish)"
      ],
      "prepTime": "15 minutes",
      "calories": "350-400",
      "description": "A vibrant and filling Thai-inspired zoodle bowl with a spicy peanut sauce, packed with protein-rich chickpeas and fresh veggies.",
      "instructions": [
        "In a small bowl, whisk together peanut butter, soy sauce, lime juice, ginger, garlic, and sriracha until smooth.",
        "In a large pan, sauté red bell pepper over medium heat for about 3 minutes until slightly softened.",
        "Add spiralized zucchini and chickpeas to the pan and cook for another 3-4 minutes until zucchini is tender but still crisp.",
        "Stir in baby spinach until wilted.",
        "Pour the peanut sauce over the vegetables and toss to combine until everything is well coated.",
        "Transfer to a bowl and garnish with chopped peanuts and sesame seeds if desired."
      ],
      "nutritionNotes": "This meal is rich in protein from chickpeas and healthy fats from peanut butter, making it ideal for sustaining energy through the afternoon. Zoodles provide a low-carb, high-fiber base, while the vegetables add essential vitamins and minerals. The optional peanut and sesame garnishes add a crunchy texture and additional nutrients.",
      "generatedAt": "2025-08-15T16:03:00.741Z",
      "id": "1755273780741",
      "isAIGenerated": true,
      "responseTimeMs": 180332
    },
    {
      "name": "Mediterranean Chickpea and Veggie Pita Pocket",
      "type": "lunch",
      "ingredients": [
        "1 whole wheat pita pocket",
        "1/2 cup canned chickpeas, drained and rinsed",
        "1 small red bell pepper, sliced",
        "1 small cucumber, sliced",
        "1/4 cup cherry tomatoes, halved",
        "1/4 cup fresh spinach leaves",
        "1/4 cup feta cheese, crumbled",
        "2 tablespoons olive oil",
        "1 tablespoon red wine vinegar",
        "1 clove garlic, minced",
        "Juice of half a lemon",
        "Salt and pepper to taste",
        "1 tablespoon fresh parsley, chopped"
      ],
      "prepTime": "15 minutes",
      "calories": "350-400",
      "description": "A refreshing and light pita pocket filled with a medley of Mediterranean flavors, perfect for a busy lunch.",
      "instructions": [
        "In a small bowl, whisk together olive oil, red wine vinegar, minced garlic, lemon juice, salt, and pepper to make the dressing.",
        "In a medium bowl, combine chickpeas, bell pepper, cucumber, cherry tomatoes, and spinach.",
        "Pour the dressing over the vegetable and chickpea mixture, tossing to coat evenly.",
        "Cut the pita pocket in half and open it to form a pocket.",
        "Fill the pita with the chickpea and veggie mixture, top with crumbled feta cheese, and garnish with fresh parsley."
      ],
      "nutritionNotes": "This meal is rich in plant-based protein from chickpeas, offers healthy fats from olive oil, and provides fiber and vitamins from a variety of vegetables. It's a balanced choice that supports an active lifestyle with sustained energy.",
      "generatedAt": "2025-08-16T16:02:34.196Z",
      "id": "1755360154196",
      "isAIGenerated": true,
      "responseTimeMs": 153807
    },
    {
      "name": "Veggie and Hummus Whole Wheat Pita Pocket",
      "type": "lunch",
      "ingredients": [
        "whole wheat pita bread",
        "hummus",
        "baby spinach",
        "cucumber",
        "cherry tomatoes",
        "carrots",
        "bell pepper",
        "feta cheese",
        "olive oil",
        "lemon juice",
        "salt and pepper"
      ],
      "prepTime": "15 minutes",
      "calories": "350-450",
      "description": "A refreshing and satisfying pita pocket filled with crisp veggies, creamy hummus, and tangy feta cheese, perfect for a light yet nutritious lunch.",
      "instructions": [
        "Slice the cucumber, cherry tomatoes, carrots, and bell pepper into bite-sized pieces.",
        "Drizzle the vegetables with olive oil and lemon juice, then season with salt and pepper. Toss to coat.",
        "Cut the pita bread in half and spread a generous amount of hummus on the inside of each half.",
        "Layer baby spinach leaves, the seasoned vegetables, and crumbled feta cheese into the pita.",
        "Fold the pita pocket and enjoy immediately or pack for an on-the-go lunch."
      ],
      "nutritionNotes": "This meal is packed with fiber from the veggies and whole grains from the pita, providing sustained energy. The hummus offers plant-based protein and healthy fats, while feta adds a touch of calcium. It's a balanced meal that supports an active lifestyle.",
      "generatedAt": "2025-08-17T16:02:14.783Z",
      "id": "1755446534783",
      "isAIGenerated": true,
      "responseTimeMs": 134059
    },
    {
      "name": "Mason Jar Mediterranean Chicken Salad",
      "type": "lunch",
      "ingredients": [
        "2 boneless, skinless chicken breasts",
        "1 cup cherry tomatoes",
        "1 cucumber",
        "1/2 red onion",
        "1 cup Kalamata olives",
        "1/2 cup feta cheese",
        "2 tablespoons olive oil",
        "1 tablespoon lemon juice",
        "1 teaspoon dried oregano",
        "Salt and pepper to taste",
        "Mixed greens"
      ],
      "prepTime": "30 minutes",
      "calories": "350-450",
      "description": "A refreshing and protein-packed Mediterranean chicken salad, layered in a mason jar for convenience and ease, perfect for a busy lunch.",
      "instructions": [
        "Season the chicken breasts with salt, pepper, and oregano. Grill or bake until fully cooked, then slice.",
        "In a mason jar, begin with a layer of mixed greens.",
        "Add a layer of sliced cucumber, cherry tomatoes, red onion, Kalamata olives, and feta cheese.",
        "Layer the sliced chicken on top.",
        "In a small bowl, whisk together olive oil, lemon juice, salt, and pepper. Pour over the salad in the jar.",
        "Tighten the lid and shake gently to combine the dressing with the ingredients. Enjoy straight from the jar."
      ],
      "nutritionNotes": "This meal offers a balanced mix of lean protein, healthy fats, and fiber, ideal for maintaining energy and supporting an active lifestyle. The use of seasonal ingredients like tomatoes and cucumbers provides essential vitamins and minerals.",
      "generatedAt": "2025-08-18T16:02:21.326Z",
      "id": "1755532941326",
      "isAIGenerated": true,
      "responseTimeMs": 141003
    },
    {
      "name": "Lemon Herb Chicken Salad with Quinoa and Arugula",
      "type": "lunch",
      "ingredients": [
        "boneless skinless chicken breast",
        "quinoa",
        "arugula",
        "lemon",
        "fresh parsley",
        "fresh dill",
        "olive oil",
        "salt",
        "black pepper",
        "crumbled feta cheese (optional)",
        "cherry tomatoes",
        "cucumber"
      ],
      "prepTime": "30 minutes",
      "calories": "400-500",
      "description": "A light yet satisfying lunch featuring a lemon herb chicken salad with fluffy quinoa and peppery arugula, perfect for an active lifestyle.",
      "instructions": [
        "Cook quinoa according to package instructions. Set aside to cool.",
        "Season chicken breast with salt, pepper, and lemon zest. Grill or pan-sear until fully cooked. Let it rest, then slice into strips.",
        "In a large bowl, mix arugula, cooled quinoa, cherry tomatoes, cucumber, and crumbled feta if using.",
        "In a small bowl, whisk together olive oil, lemon juice, chopped parsley, chopped dill, salt, and pepper to create a dressing.",
        "Add sliced chicken to the salad bowl and drizzle with the dressing. Toss gently to combine.",
        "Serve immediately or portion into containers for a grab-and-go lunch."
      ],
      "nutritionNotes": "This meal provides a balanced mix of protein, healthy fats, and complex carbohydrates. The lemon and herbs add flavor without excess calories, while the arugula and quinoa offer fiber and essential nutrients for sustained energy.",
      "generatedAt": "2025-08-19T16:02:23.268Z",
      "id": "1755619343268",
      "isAIGenerated": true,
      "responseTimeMs": 143246
    },
    {
      "name": "Grilled Chicken and Quinoa Salad with Seasonal Veggies",
      "type": "lunch",
      "ingredients": [
        "boneless skinless chicken breast",
        "quinoa",
        "mixed greens (spinach, arugula, lettuce)",
        "red bell pepper",
        "yellow bell pepper",
        "cucumber",
        "feta cheese (optional)",
        "lemon juice",
        "olive oil",
        "salt",
        "pepper",
        "garlic powder"
      ],
      "prepTime": "30 minutes",
      "calories": "450-550",
      "description": "A refreshing and satisfying grilled chicken salad with fluffy quinoa and vibrant seasonal veggies, topped with a zesty lemon-olive oil dressing.",
      "instructions": [
        "Preheat grill or grill pan over medium-high heat. Season chicken breast with salt, pepper, and garlic powder.",
        "Grill chicken for 6-7 minutes per side until fully cooked. Let rest, then slice into strips.",
        "Cook quinoa according to package instructions. Fluff with a fork and let cool.",
        "Chop red and yellow bell peppers and cucumber into bite-sized pieces.",
        "In a large bowl, combine mixed greens, quinoa, bell peppers, cucumber, and grilled chicken.",
        "Crush feta cheese and sprinkle over the salad if using.",
        "In a small bowl, whisk together lemon juice, olive oil, salt, and pepper. Drizzle over salad and toss gently to combine."
      ],
      "nutritionNotes": "This meal provides a balanced mix of lean protein from chicken, complex carbs from quinoa, and a variety of vitamins and minerals from the fresh vegetables. The olive oil dressing adds healthy fats, making it a well-rounded option for sustaining energy throughout a busy day.",
      "generatedAt": "2025-08-20T16:02:32.802Z",
      "id": "1755705752802",
      "isAIGenerated": true,
      "responseTimeMs": 152402
    },
    {
      "name": "Lentil and Roasted Vegetable Salad",
      "type": "lunch",
      "ingredients": [
        "1 cup green lentils",
        "1 medium carrot, diced",
        "1 red bell pepper, diced",
        "1 small zucchini, diced",
        "1 tablespoon olive oil",
        "1 teaspoon dried thyme",
        "1 teaspoon dried oregano",
        "Salt and pepper to taste",
        "2 cups mixed greens (e.g., arugula, spinach)",
        "1/4 cup feta cheese (optional)",
        "1 tablespoon balsamic vinegar",
        "1 tablespoon lemon juice",
        "1 tablespoon olive oil"
      ],
      "prepTime": "45 minutes",
      "calories": "350-400",
      "description": "A delightful mix of hearty lentils and roasted vegetables, tossed with fresh greens and a zesty lemon-balsamic dressing for a refreshing and satisfying lunch.",
      "instructions": [
        "Preheat oven to 400°F (200°C). Toss the diced carrot, red bell pepper, and zucchini with olive oil, thyme, oregano, salt, and pepper. Spread on a baking sheet and roast for 20-25 minutes, or until vegetables are tender and slightly charred.",
        "While the vegetables are roasting, rinse the green lentils under cold water. Place them in a pot with 2 cups of water and bring to a boil. Reduce heat, cover, and simmer for 15-20 minutes, or until lentils are tender but not mushy. Drain any excess water.",
        "In a large bowl, combine the roasted vegetables, cooked lentils, and mixed greens. Crumble feta cheese over the top if using.",
        "Whisk together balsamic vinegar, lemon juice, and olive oil. Drizzle the dressing over the salad and toss to combine. Season with additional salt and pepper if desired."
      ],
      "nutritionNotes": "This meal is packed with protein from lentils, fiber from vegetables, and healthy fats from olive oil. It's a balanced option that supports an active lifestyle, providing sustained energy without being too heavy.",
      "generatedAt": "2025-08-21T16:02:56.803Z",
      "id": "1755792176803",
      "isAIGenerated": true,
      "responseTimeMs": 175817
    },
    {
      "name": "Sweet Potato and Black Bean Quinoa Bowl",
      "type": "lunch",
      "ingredients": [
        "1 medium sweet potato",
        "1 can black beans, drained and rinsed",
        "1 cup quinoa",
        "1 avocado",
        "1 cup cherry tomatoes, halved",
        "1/4 cup red onion, finely chopped",
        "1 lime",
        "2 tbsp olive oil",
        "Salt and pepper to taste",
        "1/2 tsp ground cumin",
        "1/2 tsp paprika",
        "Fresh cilantro for garnish"
      ],
      "prepTime": "30 minutes",
      "calories": "400-500",
      "description": "A vibrant and nourishing bowl combining roasted sweet potato, protein-packed black beans, and fluffy quinoa, topped with fresh avocado and tomatoes. Perfect for an active lifestyle.",
      "instructions": [
        "Preheat oven to 400°F (200°C). Dice the sweet potato and toss with 1 tbsp olive oil, cumin, paprika, salt, and pepper. Spread on a baking sheet and roast for 25 minutes, stirring halfway through.",
        "While the sweet potato roasts, cook quinoa according to package instructions. Fluff with a fork and set aside.",
        "In a large bowl, combine the roasted sweet potato, cooked quinoa, black beans, cherry tomatoes, and red onion.",
        "Dice the avocado and add to the bowl. Squeeze the juice of half a lime over the mixture, drizzle with the remaining olive oil, and toss gently.",
        "Season with salt and pepper to taste, and garnish with fresh cilantro before serving."
      ],
      "nutritionNotes": "This meal provides a balanced mix of complex carbohydrates from quinoa and sweet potatoes, protein from black beans, and healthy fats from avocado. It's rich in fiber and vitamins, supporting energy levels and satiety throughout the day.",
      "generatedAt": "2025-08-22T16:02:41.518Z",
      "id": "1755878561518",
      "isAIGenerated": true,
      "responseTimeMs": 160692
    },
    {
      "name": "Roasted Sweet Potato and Lentil Salad with Apple Cider Vinaigrette",
      "type": "lunch",
      "ingredients": [
        "1 medium sweet potato",
        "1/2 cup dried green lentils",
        "1 cup baby spinach",
        "1/2 cup cherry tomatoes, halved",
        "1/4 cup red onion, thinly sliced",
        "1 apple, diced",
        "1 tablespoon olive oil",
        "1 tablespoon apple cider vinegar",
        "1 teaspoon honey",
        "Salt and pepper to taste",
        "1 tablespoon chia seeds",
        "1/4 cup feta cheese, crumbled (optional)"
      ],
      "prepTime": "30 minutes",
      "calories": "350-450",
      "description": "A vibrant and satisfying salad featuring roasted sweet potatoes, protein-rich lentils, and a tangy apple cider vinaigrette, perfect for a nourishing lunch.",
      "instructions": [
        "Preheat your oven to 400°F (200°C). Peel and dice the sweet potato into 1-inch cubes. Toss with 1 tablespoon of olive oil, salt, and pepper. Spread on a baking sheet and roast for 20-25 minutes until tender and lightly caramelized.",
        "While the sweet potatoes are roasting, rinse the green lentils and cook according to package instructions. Once cooked, drain any excess water and let them cool.",
        "In a small bowl, whisk together apple cider vinegar, honey, olive oil, salt, and pepper to create the vinaigrette.",
        "In a large bowl, combine roasted sweet potatoes, cooked lentils, baby spinach, cherry tomatoes, red onion, and diced apple.",
        "Drizzle the vinaigrette over the salad and toss to combine. Top with chia seeds and crumbled feta cheese if using. Serve immediately or store in an airtight container for a quick lunch the next day."
      ],
      "nutritionNotes": "This meal is packed with complex carbohydrates from the sweet potatoes and lentils, providing sustained energy. The spinach and apple offer vitamins and antioxidants, while the chia seeds add healthy fats and fiber. The vinaigrette's apple cider vinegar can aid digestion and improve gut health.",
      "generatedAt": "2025-08-23T16:03:02.179Z",
      "id": "1755964982179",
      "isAIGenerated": true,
      "responseTimeMs": 181996
    },
    {
      "name": "Turkey and Quinoa Stuffed Bell Peppers",
      "type": "lunch",
      "ingredients": [
        "4 medium bell peppers, tops cut off and seeds removed",
        "1 cup cooked quinoa",
        "4 oz ground turkey",
        "1/2 cup canned black beans, rinsed and drained",
        "1 small onion, diced",
        "1 clove garlic, minced",
        "1/2 cup corn kernels (fresh or frozen)",
        "1 tsp chili powder",
        "1/2 tsp cumin",
        "Salt and pepper to taste",
        "1/4 cup shredded cheese (optional)",
        "Fresh cilantro for garnish (optional)"
      ],
      "prepTime": "30 minutes",
      "calories": "350-400",
      "description": "A vibrant and hearty lunch option featuring turkey and quinoa stuffed into colorful bell peppers, seasoned with warm spices and topped with cheese.",
      "instructions": [
        "Preheat oven to 375°F (190°C).",
        "In a skillet over medium heat, cook the diced onion and garlic until soft. Add the ground turkey and cook until browned.",
        "Stir in the cooked quinoa, black beans, corn, chili powder, cumin, salt, and pepper. Cook for an additional 5 minutes.",
        "Spoon the turkey and quinoa mixture into the hollowed bell peppers. Place peppers in a baking dish.",
        "Bake for 25-30 minutes, until the peppers are tender. Top with shredded cheese during the last 5 minutes of baking, if desired.",
        "Garnish with fresh cilantro before serving."
      ],
      "nutritionNotes": "This meal provides a balanced mix of protein from the turkey, complex carbohydrates from quinoa, and fiber from the beans and vegetables. It's a nutrient-dense option that supports an active lifestyle while being budget-friendly.",
      "generatedAt": "2025-08-25T16:02:39.216Z",
      "id": "1756137759216",
      "isAIGenerated": true,
      "responseTimeMs": 158546
    },
    {
      "name": "Mango and Shrimp Stir-Fry over Brown Rice",
      "type": "lunch",
      "ingredients": [
        "1 cup brown rice",
        "1 pound shrimp, peeled and deveined",
        "1 cup mango, diced",
        "1 bell pepper, sliced",
        "1 cup snap peas",
        "2 tablespoons soy sauce",
        "1 tablespoon sesame oil",
        "1 tablespoon olive oil",
        "1 garlic clove, minced",
        "1 teaspoon ginger, grated",
        "Salt and pepper to taste"
      ],
      "prepTime": "30 minutes",
      "calories": "400-500",
      "description": "A vibrant and refreshing stir-fry that combines sweet mango with savory shrimp, served over nutritious brown rice for a balanced and satisfying lunch.",
      "instructions": [
        "Cook brown rice according to package instructions; set aside.",
        "Heat olive oil in a large pan over medium heat. Add garlic and ginger, sauté for 1 minute until fragrant.",
        "Add shrimp to the pan, season with salt and pepper, and cook until they turn pink, about 2-3 minutes. Remove shrimp from the pan and set aside.",
        "In the same pan, add sesame oil, bell pepper, and snap peas. Sauté for 3-4 minutes until vegetables are tender.",
        "Return shrimp to the pan, add mango and soy sauce. Stir-fry for another 2 minutes until everything is well combined.",
        "Serve the stir-fry over the cooked brown rice."
      ],
      "nutritionNotes": "This meal provides a balance of protein from shrimp, carbohydrates from brown rice, and vitamins and minerals from fresh vegetables and mango. It's a great option for active individuals needing a light yet energizing lunch.",
      "generatedAt": "2025-08-26T16:02:29.131Z",
      "id": "1756224149131",
      "isAIGenerated": true,
      "responseTimeMs": 148828
    },
    {
      "name": "Quinoa Veggie Stir-Fry with Tofu",
      "type": "lunch",
      "ingredients": [
        "1 cup cooked quinoa",
        "1 cup firm tofu, cubed",
        "1 cup broccoli florets",
        "1 bell pepper, sliced",
        "1 carrot, julienned",
        "1 tablespoon soy sauce",
        "1 tablespoon sesame oil",
        "1 teaspoon garlic, minced",
        "1 teaspoon ginger, grated",
        "2 tablespoons cashews, chopped",
        "Sesame seeds for garnish"
      ],
      "prepTime": "25 minutes",
      "calories": "350-400",
      "description": "A delightful stir-fry featuring crispy tofu, fresh seasonal veggies, and nutty quinoa, garnished with sesame seeds for a satisfying crunch.",
      "instructions": [
        "Heat sesame oil in a large pan or wok over medium-high heat. Add tofu cubes and cook until golden brown, about 5-7 minutes. Remove tofu and set aside.",
        "In the same pan, add garlic and ginger, sauté for 1 minute. Add broccoli, bell pepper, and carrot. Stir-fry until vegetables are tender-crisp, about 5 minutes.",
        "Add cooked quinoa and tofu back into the pan. Pour soy sauce over the mixture and toss to combine everything well, cooking for an additional 2 minutes.",
        "Sprinkle with chopped cashews and garnish with sesame seeds before serving."
      ],
      "nutritionNotes": "This meal offers a balance of protein from tofu and quinoa, healthy fats from sesame oil and cashews, and a variety of vitamins and minerals from the colorful vegetables. It's perfect for an active lifestyle due to its protein content and complex carbohydrates.",
      "generatedAt": "2025-08-28T16:03:01.481Z",
      "id": "1756396981481",
      "isAIGenerated": true,
      "responseTimeMs": 181202
    },
    {
      "name": "Savory Pumpkin and Chickpea Stuffed Sweet Potatoes",
      "type": "lunch",
      "ingredients": [
        "1 medium sweet potato",
        "1/2 cup canned chickpeas, drained and rinsed",
        "1/2 cup canned pumpkin puree",
        "1 tablespoon olive oil",
        "1 teaspoon cumin",
        "1 teaspoon smoked paprika",
        "1/2 teaspoon garlic powder",
        "Salt and pepper to taste",
        "2 tablespoons chopped fresh parsley",
        "1 tablespoon lemon juice",
        "Optional: feta cheese crumbles or sliced avocado"
      ],
      "prepTime": "30 minutes",
      "calories": "350-400",
      "description": "A cozy and satisfying lunch featuring roasted sweet potatoes stuffed with a savory blend of pumpkin and chickpeas, seasoned with warm spices and fresh parsley.",
      "instructions": [
        "Preheat your oven to 400°F (200°C).",
        "Pierce the sweet potato with a fork and place it on a baking sheet. Roast for 25-30 minutes, or until tender.",
        "While the sweet potato is roasting, combine chickpeas, pumpkin puree, olive oil, cumin, smoked paprika, garlic powder, salt, and pepper in a bowl.",
        "Once the sweet potato is done, slice it open and fluff the inside with a fork.",
        "Fill each sweet potato with the chickpea and pumpkin mixture.",
        "Top with chopped parsley, lemon juice, and optional feta cheese or avocado.",
        "Serve immediately and enjoy!"
      ],
      "nutritionNotes": "This meal offers a balanced mix of carbohydrates, protein, and healthy fats. Sweet potatoes are rich in vitamins A and C, while chickpeas provide plant-based protein and fiber. Pumpkin adds a seasonal touch with its vitamin A content and fiber.",
      "generatedAt": "2025-08-29T16:02:37.265Z",
      "id": "1756483357265",
      "isAIGenerated": true,
      "responseTimeMs": 156631
    },
    {
      "name": "Chickpea and Spinach Frittata Muffins",
      "type": "lunch",
      "ingredients": [
        "12 eggs",
        "1 cup chickpeas, drained and rinsed",
        "2 cups fresh spinach",
        "1 small onion, finely chopped",
        "1 bell pepper, diced",
        "1/2 cup feta cheese, crumbled",
        "1 teaspoon garlic powder",
        "1 teaspoon smoked paprika",
        "Salt and pepper to taste",
        "1 tablespoon olive oil",
        "Fresh parsley for garnish"
      ],
      "prepTime": "15 minutes",
      "calories": "180-200 per muffin",
      "description": "These portable, protein-packed muffins are perfect for a quick, nutritious lunch. With the vibrant flavors of spinach, bell pepper, and feta, they offer a satisfying bite that's easy to eat on the go.",
      "instructions": [
        "Preheat your oven to 375°F (190°C) and lightly grease a muffin tin.",
        "In a large bowl, whisk together eggs, garlic powder, smoked paprika, salt, and pepper.",
        "Add chickpeas, spinach, onion, bell pepper, and feta cheese to the egg mixture and stir well.",
        "Divide the mixture evenly among the muffin cups, filling each about 3/4 full.",
        "Bake for 20-25 minutes, or until the muffins are set and lightly golden.",
        "Remove from the oven and let cool slightly before removing from the tin.",
        "Garnish with fresh parsley before serving."
      ],
      "nutritionNotes": "These muffins are a great source of protein from eggs and chickpeas, supporting muscle repair and energy levels. Spinach adds iron and fiber, while the feta provides calcium and a tangy flavor. They're also rich in antioxidants from the vegetables, making them a balanced choice for an active lifestyle.",
      "generatedAt": "2025-08-30T16:02:44.053Z",
      "id": "1756569764053",
      "isAIGenerated": true,
      "responseTimeMs": 163121
    },
    {
      "name": "Cauliflower Rice Tabbouleh with Grilled Chicken",
      "type": "lunch",
      "ingredients": [
        "1 cup cauliflower rice",
        "1 small cucumber, diced",
        "1 cup cherry tomatoes, halved",
        "1/2 cup fresh parsley, chopped",
        "1/4 cup fresh mint, chopped",
        "1/4 cup lemon juice",
        "2 tbsp olive oil",
        "1 clove garlic, minced",
        "Salt and pepper to taste",
        "2 boneless, skinless chicken breasts",
        "1 tsp paprika",
        "1 tsp cumin",
        "1 tbsp olive oil"
      ],
      "prepTime": "30 minutes",
      "calories": "450-500",
      "description": "A refreshing and protein-packed lunch with the zesty flavors of tabbouleh, paired with perfectly grilled chicken.",
      "instructions": [
        "Preheat grill or grill pan over medium-high heat. Season chicken breasts with paprika, cumin, salt, and pepper. Drizzle with olive oil.",
        "Grill chicken for about 6-7 minutes per side, or until fully cooked. Let rest for a few minutes before slicing.",
        "In a large bowl, combine cauliflower rice, cucumber, cherry tomatoes, parsley, mint, lemon juice, olive oil, and garlic. Toss well and season with salt and pepper.",
        "Slice grilled chicken and serve atop the cauliflower rice tabbouleh."
      ],
      "nutritionNotes": "This meal offers a good balance of protein, fiber, and healthy fats. Cauliflower rice is a low-carb alternative to traditional tabbouleh, making it lighter yet satisfying. The grilled chicken provides lean protein, essential for muscle repair and energy.",
      "generatedAt": "2025-08-31T16:03:00.911Z",
      "id": "1756656180911",
      "isAIGenerated": true,
      "responseTimeMs": 180705
    },
    {
      "name": "Spicy Black Bean and Corn Salad with Cilantro Lime Dressing",
      "type": "lunch",
      "ingredients": [
        "1 can black beans, drained and rinsed",
        "1 cup frozen corn, thawed",
        "1 red bell pepper, diced",
        "1 medium avocado, diced",
        "1/2 red onion, finely chopped",
        "1/4 cup fresh cilantro, chopped",
        "1 tablespoon olive oil",
        "1 tablespoon lime juice",
        "1 teaspoon ground cumin",
        "1 teaspoon chili powder",
        "Salt and pepper to taste"
      ],
      "prepTime": "15 minutes",
      "calories": "350-400",
      "description": "A refreshing and flavorful salad packed with protein and fiber, perfect for a midday boost.",
      "instructions": [
        "In a large mixing bowl, combine black beans, corn, red bell pepper, avocado, and red onion.",
        "In a small bowl, whisk together olive oil, lime juice, cumin, chili powder, salt, and pepper to make the dressing.",
        "Pour the dressing over the salad and toss until everything is well coated.",
        "Garnish with fresh cilantro before serving."
      ],
      "nutritionNotes": "This meal provides a balanced mix of protein, healthy fats, and fiber, which supports energy levels and satiety. The avocado adds healthy fats, while the black beans provide a solid protein and fiber source.",
      "generatedAt": "2025-09-09T16:02:09.157Z",
      "id": "1757433729157",
      "isAIGenerated": true,
      "responseTimeMs": 128853
    },
    {
      "name": "Caprese Quinoa Salad with Basil Pesto",
      "type": "lunch",
      "ingredients": [
        "1 cup quinoa",
        "2 cups water",
        "1 cup cherry tomatoes, halved",
        "1 cup fresh mozzarella balls",
        "1/4 cup fresh basil leaves",
        "1/4 cup pine nuts",
        "2 cloves garlic",
        "1/4 cup extra virgin olive oil",
        "2 tablespoons lemon juice",
        "Salt and pepper to taste",
        "Balsamic glaze for serving"
      ],
      "prepTime": "30 minutes",
      "calories": "350-400",
      "description": "A refreshing and light Caprese-inspired quinoa salad with creamy mozzarella, juicy cherry tomatoes, and a homemade basil pesto dressing.",
      "instructions": [
        "Rinse quinoa under cold water. In a medium pot, bring 2 cups of water to a boil. Add quinoa, reduce heat to low, cover, and simmer for 15 minutes until water is absorbed. Remove from heat and let it sit covered for 5 minutes. Fluff with a fork and let cool.",
        "In a food processor, combine basil leaves, pine nuts, garlic, and a pinch of salt. Pulse until coarsely chopped. With the processor running, slowly drizzle in olive oil until the mixture is smooth. Add lemon juice, and adjust salt and pepper to taste.",
        "In a large bowl, combine cooled quinoa, cherry tomatoes, and mozzarella balls. Drizzle with basil pesto and gently toss to combine. Serve with a drizzle of balsamic glaze."
      ],
      "nutritionNotes": "This meal is packed with plant-based protein from quinoa, healthy fats from olive oil and pine nuts, and a good dose of vitamins from fresh tomatoes and basil. It's balanced, satisfying, and perfect for active lifestyles.",
      "generatedAt": "2025-09-10T16:03:02.492Z",
      "id": "1757520182492",
      "isAIGenerated": true,
      "responseTimeMs": 181988
    },
    {
      "name": "Asian-Inspired Tuna and Edamame Salad",
      "type": "lunch",
      "ingredients": [
        "1 can tuna in water, drained",
        "1 cup shelled edamame, cooked and cooled",
        "1 medium carrot, shredded",
        "1/2 cup purple cabbage, thinly sliced",
        "1/4 cup green onions, chopped",
        "1 tablespoon sesame seeds",
        "1 tablespoon soy sauce or tamari",
        "1 tablespoon rice vinegar",
        "1 teaspoon honey or maple syrup",
        "1 teaspoon sesame oil",
        "Salt and pepper to taste"
      ],
      "prepTime": "15 minutes",
      "calories": "350-400",
      "description": "A refreshing and protein-packed Asian-inspired salad that combines the flavors of sesame, soy, and fresh veggies with hearty tuna and edamame.",
      "instructions": [
        "In a large mixing bowl, combine tuna, edamame, shredded carrot, purple cabbage, and green onions.",
        "In a small bowl, whisk together soy sauce, rice vinegar, honey or maple syrup, sesame oil, salt, and pepper.",
        "Pour the dressing over the salad ingredients and toss to combine.",
        "Sprinkle sesame seeds on top before serving."
      ],
      "nutritionNotes": "This salad is rich in protein from the tuna and edamame, providing sustained energy for an active lifestyle. The vegetables add fiber and vitamins, while sesame seeds contribute healthy fats.",
      "generatedAt": "2025-09-11T16:02:23.831Z",
      "id": "1757606543831",
      "isAIGenerated": true,
      "responseTimeMs": 143732
    },
    {
      "name": "Hearty Turkey and Avocado Wrap with Greek Yogurt Ranch",
      "type": "lunch",
      "ingredients": [
        "whole wheat tortilla",
        "sliced turkey breast",
        "sliced avocado",
        "baby spinach",
        "red bell pepper",
        "Greek yogurt",
        "sliced cucumber",
        "dill",
        "lemon juice",
        "salt",
        "pepper"
      ],
      "prepTime": "15 minutes",
      "calories": "350-400",
      "description": "A flavorful and nutritious wrap filled with protein-packed turkey, creamy avocado, and fresh veggies, topped with a homemade Greek yogurt ranch dressing.",
      "instructions": [
        "In a bowl, mix Greek yogurt with sliced cucumber, dill, lemon juice, salt, and pepper to create the ranch dressing.",
        "Spread a generous amount of the ranch dressing onto a whole wheat tortilla.",
        "Layer sliced turkey breast, avocado, baby spinach, and thinly sliced red bell pepper on the tortilla.",
        "Roll the tortilla tightly and slice in half for easy eating."
      ],
      "nutritionNotes": "This wrap provides a balance of protein, healthy fats, and fiber, making it ideal for sustaining energy throughout your busy day. The Greek yogurt ranch offers a creamy dressing with fewer calories than traditional mayonnaise-based options.",
      "generatedAt": "2025-09-12T16:02:28.252Z",
      "id": "1757692948252",
      "isAIGenerated": true,
      "responseTimeMs": 148013
    }
  ],
  "lastGenerated": "2025-09-12T16:02:28.252Z"
}