{
  "snacks": [
    {
      "name": "Avocado and Egg Toast",
      "type": "snack",
      "ingredients": [
        "whole grain bread",
        "avocado",
        "egg",
        "salt",
        "pepper"
      ],
      "prepTime": "5 minutes",
      "calories": "250",
      "description": "A quick and nutritious snack featuring creamy avocado and a protein-packed hard-boiled egg on whole grain toast.",
      "instructions": [
        "Toast a slice of whole grain bread.",
        "Mash half an avocado and spread it on the toast.",
        "Slice a hard-boiled egg and place it on top of the avocado.",
        "Season with salt and pepper to taste."
      ],
      "benefits": "This snack is rich in healthy fats from the avocado, providing sustained energy, and offers protein from the egg for satiety. Whole grain bread adds fiber, which aids in digestion and keeps you full longer.",
      "generatedAt": "2025-08-04T19:01:27.368Z",
      "id": "1754334087368",
      "isAIGenerated": true,
      "responseTimeMs": 86916
    },
    {
      "name": "Banana and Almond Butter Bites",
      "type": "snack",
      "ingredients": [
        "1 medium banana",
        "2 tablespoons almond butter",
        "1 tablespoon chia seeds"
      ],
      "prepTime": "5 minutes",
      "calories": "250",
      "description": "Simple and nutritious banana bites coated with almond butter and sprinkled with chia seeds, perfect for a quick energy boost.",
      "instructions": [
        "Peel the banana and cut it into 1-inch thick slices.",
        "Spread each banana slice with about 1/2 tablespoon of almond butter.",
        "Roll the almond butter side in chia seeds to coat.",
        "Place bites on a plate or tray and refrigerate for a few minutes to set."
      ],
      "benefits": "Banana provides natural sugars and potassium for quick energy, while almond butter offers healthy fats and protein for sustained energy. Chia seeds add fiber and omega-3 fatty acids, making this a balanced snack.",
      "generatedAt": "2025-08-05T19:01:33.785Z",
      "id": "1754420493785",
      "isAIGenerated": true,
      "responseTimeMs": 92756
    },
    {
      "name": "Celery and Sunflower Seed Spread",
      "type": "snack",
      "ingredients": [
        "celery sticks",
        "sunflower seed butter",
        "chia seeds",
        "honey"
      ],
      "prepTime": "5 minutes",
      "calories": "150",
      "description": "A crunchy and creamy snack with a touch of sweetness.",
      "instructions": [
        "Wash and cut celery sticks into manageable pieces.",
        "Mix 2 tablespoons of sunflower seed butter with 1 teaspoon of chia seeds and a drizzle of honey.",
        "Spread the mixture onto the celery sticks.",
        "Optionally, sprinkle a few more chia seeds on top for extra texture."
      ],
      "benefits": "This snack is high in fiber and healthy fats, providing sustained energy without a sugar crash. Sunflower seed butter offers protein and essential nutrients like magnesium, while chia seeds contribute omega-3 fatty acids and fiber. Celery offers hydration and crunch, making it a refreshing choice for a busy day.",
      "generatedAt": "2025-08-06T19:01:35.141Z",
      "id": "1754506895141",
      "isAIGenerated": true,
      "responseTimeMs": 94394
    },
    {
      "name": "Veggie and Hummus Rice Paper Rolls",
      "type": "snack",
      "ingredients": [
        "Rice paper",
        "Carrot",
        "Cucumber",
        "Bell pepper",
        "Mint leaves",
        "Hummus"
      ],
      "prepTime": "10 minutes",
      "calories": "150",
      "description": "A refreshing and portable snack that combines crunchy veggies with creamy hummus in a light rice paper wrap.",
      "instructions": [
        "Soak a rice paper sheet in warm water until pliable.",
        "Place the rice paper on a clean surface.",
        "Add a small amount of hummus in the center.",
        "Layer thinly sliced carrot, cucumber, bell pepper, and a few mint leaves on top of the hummus.",
        "Roll the rice paper tightly around the filling, tucking in the sides as you go.",
        "Cut the roll in half and enjoy!"
      ],
      "benefits": "These rolls are packed with fiber from the vegetables and protein from the hummus, providing sustained energy. They are easy to prepare and carry, making them perfect for a busy lifestyle. The mint adds a refreshing element, while the rice paper keeps everything light and satisfying.",
      "generatedAt": "2025-08-07T19:01:49.590Z",
      "id": "1754593309590",
      "isAIGenerated": true,
      "responseTimeMs": 109203
    },
    {
      "name": "Cottage Cheese and Pineapple Cups",
      "type": "snack",
      "ingredients": [
        "cottage cheese",
        "pineapple chunks",
        "chia seeds"
      ],
      "prepTime": "5 minutes",
      "calories": "150",
      "description": "A refreshing and protein-packed snack perfect for busy schedules.",
      "instructions": [
        "Scoop cottage cheese into a small cup or container.",
        "Top with pineapple chunks and sprinkle with chia seeds."
      ],
      "benefits": "This snack provides a balance of protein from cottage cheese, natural sweetness, and fiber from pineapple, along with omega-3s and additional fiber from chia seeds. It's portable, easy to prepare, and helps sustain energy levels with a mix of macronutrients.",
      "generatedAt": "2025-08-08T19:02:09.323Z",
      "id": "1754679729323",
      "isAIGenerated": true,
      "responseTimeMs": 128540
    },
    {
      "name": "Cucumber and Turkey Roll-Ups",
      "type": "snack",
      "ingredients": [
        "sliced cucumber",
        "sliced turkey breast",
        "cream cheese",
        "fresh dill"
      ],
      "prepTime": "5 minutes",
      "calories": "150",
      "description": "A refreshing and protein-packed snack that combines the crispness of cucumber with the savory flavors of turkey and cream cheese.",
      "instructions": [
        "Lay out the cucumber slices on a clean surface.",
        "Spread a thin layer of cream cheese on each cucumber slice.",
        "Sprinkle a small amount of fresh dill on the cream cheese.",
        "Place a slice of turkey breast on top of the cream cheese.",
        "Carefully roll up the cucumber slices to enclose the turkey."
      ],
      "benefits": "This snack is a great source of lean protein from the turkey, which helps keep you full and energized throughout your busy day. The cucumber provides hydration and essential vitamins, while the cream cheese offers a creamy texture and a hint of calcium. The fresh dill adds flavor without extra calories, making it a nutritious, balanced option for sustained energy.",
      "generatedAt": "2025-08-09T19:01:47.467Z",
      "id": "1754766107467",
      "isAIGenerated": true,
      "responseTimeMs": 107363
    },
    {
      "name": "Edamame and Sea Salt Bites",
      "type": "snack",
      "ingredients": [
        "frozen shelled edamame",
        "sea salt"
      ],
      "prepTime": "5 minutes",
      "calories": "120",
      "description": "A delicious and nutritious snack of steamed edamame sprinkled with a dash of sea salt for a satisfying crunch.",
      "instructions": [
        "Boil a pot of water and add the frozen shelled edamame.",
        "Cook for 3-5 minutes until tender, then drain.",
        "Sprinkle with a pinch of sea salt and enjoy!"
      ],
      "benefits": "Edamame is rich in protein and fiber, providing sustained energy and keeping you full longer. It's also packed with essential vitamins and minerals such as iron, calcium, and folate.",
      "generatedAt": "2025-08-10T19:01:23.818Z",
      "id": "1754852483818",
      "isAIGenerated": true,
      "responseTimeMs": 83703
    },
    {
      "name": "Almond Butter and Banana Rice Cake",
      "type": "snack",
      "ingredients": [
        "Rice cakes",
        "Almond butter",
        "Banana"
      ],
      "prepTime": "5 minutes",
      "calories": "200",
      "description": "A simple and portable snack combining the nutty flavor of almond butter with the natural sweetness of banana on a crisp rice cake.",
      "instructions": [
        "Spread a tablespoon of almond butter evenly over one side of a rice cake.",
        "Slice a banana thinly and arrange the slices on top of the almond butter.",
        "Optionally, sprinkle a pinch of cinnamon or drizzle a little honey for extra flavor."
      ],
      "benefits": "This snack is excellent for sustained energy due to its combination of complex carbohydrates from the rice cake, healthy fats from the almond butter, and natural sugars from the banana. It's also easy to prepare and carry, making it ideal for busy schedules.",
      "generatedAt": "2025-08-11T19:01:29.146Z",
      "id": "1754938889146",
      "isAIGenerated": true,
      "responseTimeMs": 88449
    },
    {
      "name": "Apple Slices with Peanut Butter",
      "type": "snack",
      "ingredients": [
        "1 medium apple",
        "2 tablespoons natural peanut butter"
      ],
      "prepTime": "5 minutes",
      "calories": "250",
      "description": "A simple and delicious snack that combines the natural sweetness of apple slices with the protein and healthy fats of peanut butter.",
      "instructions": [
        "Wash and core the apple.",
        "Slice the apple into even rounds.",
        "Spread peanut butter on each apple slice."
      ],
      "benefits": "This snack is excellent for sustained energy due to its combination of carbohydrates from the apple and protein and healthy fats from the peanut butter. It's portable, easy to prepare, and satisfies hunger between meals, making it perfect for busy schedules.",
      "generatedAt": "2025-08-12T19:01:17.247Z",
      "id": "1755025277247",
      "isAIGenerated": true,
      "responseTimeMs": 77233
    },
    {
      "name": "Greek Yogurt and Honey Granola Cups",
      "type": "snack",
      "ingredients": [
        "plain Greek yogurt",
        "store-bought granola",
        "honey",
        "mixed berries"
      ],
      "prepTime": "5 minutes",
      "calories": "200",
      "description": "A delicious and nutritious snack that combines protein-rich Greek yogurt with crunchy granola and sweet honey, topped with antioxidant-rich berries.",
      "instructions": [
        "Scoop 1/4 cup of Greek yogurt into a small portable container or cup.",
        "Sprinkle 2 tablespoons of granola over the yogurt.",
        "Drizzle 1 teaspoon of honey on top.",
        "Garnish with a few mixed berries."
      ],
      "benefits": "This snack provides a balanced mix of protein, healthy fats, and carbohydrates, which help sustain energy levels throughout the day. The Greek yogurt offers a protein boost, while the granola and honey provide quick energy and fiber. Berries add antioxidants for an extra nutritional punch, making it a satisfying option for busy individuals.",
      "generatedAt": "2025-08-13T19:01:48.299Z",
      "id": "1755111708299",
      "isAIGenerated": true,
      "responseTimeMs": 108063
    },
    {
      "name": "Greek Yogurt and Mixed Berry Skewers",
      "type": "snack",
      "ingredients": [
        "Greek yogurt",
        "assorted berries (e.g., strawberries, blueberries, raspberries)",
        "chocolate chips (optional)",
        "toothpicks or small skewers"
      ],
      "prepTime": "5 minutes",
      "calories": "150",
      "description": "A refreshing and energizing snack combining the protein-rich Greek yogurt with antioxidant-packed berries, perfect for quick preparation and portability.",
      "instructions": [
        "Wash and prepare the assorted berries.",
        "Spoon a small amount of Greek yogurt onto a toothpick or skewer.",
        "Thread a few berries onto the skewer, alternating with yogurt, until the skewer is filled.",
        "Optionally, add a small piece of dark chocolate chip at the end for a sweet touch.",
        "Repeat until all ingredients are used, or desired amount of skewers is reached."
      ],
      "benefits": "This snack provides a balance of protein from the Greek yogurt, which helps sustain energy levels, and natural sugars and fiber from the berries, which offer quick energy. Berries are rich in antioxidants and vitamins, supporting overall health. The optional dark chocolate adds a touch of indulgence while providing antioxidants and a small boost of energy.",
      "generatedAt": "2025-08-14T19:01:55.018Z",
      "id": "1755198115018",
      "isAIGenerated": true,
      "responseTimeMs": 114534
    },
    {
      "name": "Whole Grain Crackers with Nut Butter and Sliced Pear",
      "type": "snack",
      "ingredients": [
        "whole grain crackers",
        "peanut butter or almond butter",
        "ripe pear"
      ],
      "prepTime": "5 minutes",
      "calories": "150 per serving",
      "description": "A simple yet satisfying snack that combines the crunch of whole grain crackers with the creaminess of nut butter and the sweetness of fresh pear slices.",
      "instructions": [
        "Spread a thin layer of nut butter on each whole grain cracker.",
        "Slice the pear into thin rounds.",
        "Place a few pear slices on top of the nut butter-covered crackers."
      ],
      "benefits": "This snack is packed with complex carbohydrates from the whole grain crackers, protein and healthy fats from the nut butter, and natural sugars and fiber from the pear. The combination provides sustained energy and keeps you feeling full longer, making it ideal for busy schedules.",
      "generatedAt": "2025-08-15T19:01:29.493Z",
      "id": "1755284489493",
      "isAIGenerated": true,
      "responseTimeMs": 89091
    },
    {
      "name": "Chia Seed and Coconut Milk Pudding",
      "type": "snack",
      "ingredients": [
        "chia seeds",
        "unsweetened coconut milk",
        "vanilla extract",
        "honey or maple syrup"
      ],
      "prepTime": "5 minutes",
      "calories": "200",
      "description": "A creamy and satisfying pudding made with chia seeds and coconut milk, flavored with vanilla and sweetened with honey or maple syrup.",
      "instructions": [
        "In a small bowl or jar, combine 3 tablespoons of chia seeds with 1 cup of unsweetened coconut milk.",
        "Add 1/2 teaspoon of vanilla extract and 1 tablespoon of honey or maple syrup. Stir well to combine.",
        "Let the mixture sit for about 5 minutes, stirring occasionally to prevent clumping. The mixture should start to thicken.",
        "Transfer to a portable container and refrigerate for at least 15 minutes to allow it to set fully."
      ],
      "benefits": "Chia seeds are rich in omega-3 fatty acids, fiber, and protein, making this snack an excellent source of sustained energy. The healthy fats in coconut milk provide a steady release of energy, while the natural sweetness keeps cravings at bay. This snack is also hydrating and easy to digest, making it ideal for busy schedules.",
      "generatedAt": "2025-08-16T19:01:56.525Z",
      "id": "1755370916525",
      "isAIGenerated": true,
      "responseTimeMs": 115775
    },
    {
      "name": "Peanut Butter and Apple Slices with Dark Chocolate Drizzle",
      "type": "snack",
      "ingredients": [
        "1 apple",
        "2 tablespoons peanut butter",
        "1 tablespoon dark chocolate chips or dark chocolate spread"
      ],
      "prepTime": "5 minutes",
      "calories": "250",
      "description": "A delightful combination of crunchy apple slices, creamy peanut butter, and a touch of sweet, rich dark chocolate.",
      "instructions": [
        "Slice the apple into thin rounds, removing the core.",
        "Spread each apple slice with peanut butter.",
        "Melt the dark chocolate chips or spread in the microwave for about 20 seconds or until smooth.",
        "Drizzle the melted chocolate over the peanut butter-coated apple slices.",
        "Place on a plate and let the chocolate set for a few minutes before serving."
      ],
      "benefits": "This snack provides a perfect balance of carbohydrates, protein, and healthy fats, making it ideal for sustained energy. The apple offers fiber and natural sweetness, while the peanut butter provides protein and healthy fats. The dark chocolate adds antioxidants and a touch of indulgence without excessive sugar.",
      "generatedAt": "2025-08-17T19:01:43.336Z",
      "id": "1755457303336",
      "isAIGenerated": true,
      "responseTimeMs": 103218
    },
    {
      "name": "Quinoa and Berry Mix",
      "type": "snack",
      "ingredients": [
        "cooked quinoa",
        "mixed berries (e.g., blueberries, strawberries, raspberries)",
        "honey",
        "almonds"
      ],
      "prepTime": "5 minutes",
      "calories": "200",
      "description": "A delightful mix of protein-rich quinoa, antioxidant-packed berries, sweet honey, and crunchy almonds.",
      "instructions": [
        "Mix 1/2 cup of cooked quinoa with 1/2 cup of mixed berries.",
        "Drizzle with a teaspoon of honey for sweetness.",
        "Top with a handful of almonds for added crunch and healthy fats."
      ],
      "benefits": "This snack is a great source of complex carbohydrates, protein, and healthy fats, making it ideal for sustained energy. The quinoa provides a steady release of energy, while the berries offer antioxidants and vitamins, and the almonds contribute healthy fats and additional protein. It's also quick to prepare and portable, perfect for busy schedules.",
      "generatedAt": "2025-08-18T19:01:36.583Z",
      "id": "1755543696583",
      "isAIGenerated": true,
      "responseTimeMs": 95815
    },
    {
      "name": "Avocado and Chickpea Toast",
      "type": "snack",
      "ingredients": [
        "whole grain bread",
        "avocado",
        "chickpeas",
        "lemon juice",
        "salt",
        "pepper"
      ],
      "prepTime": "5 minutes",
      "calories": "250",
      "description": "A creamy and satisfying snack combining the healthy fats of avocado with the protein-rich chickpeas.",
      "instructions": [
        "Toast the whole grain bread to your desired level of crispiness.",
        "In a small bowl, mash the avocado with a fork until smooth.",
        "Rinse and drain the chickpeas, then mash them with a fork until they reach a chunky consistency.",
        "Combine the mashed avocado and chickpeas in the bowl, adding a squeeze of lemon juice, and a pinch of salt and pepper to taste.",
        "Spread the mixture generously onto the toasted bread."
      ],
      "benefits": "This snack is packed with healthy fats from avocado, providing sustained energy and satiety. Chickpeas add a good amount of plant-based protein and fiber, supporting muscle maintenance and digestive health, making it a balanced choice for busy days.",
      "generatedAt": "2025-08-19T19:01:47.086Z",
      "id": "1755630107086",
      "isAIGenerated": true,
      "responseTimeMs": 106633
    },
    {
      "name": "Oat and Nut Energy Balls",
      "type": "snack",
      "ingredients": [
        "Rolled oats",
        "Honey",
        "Peanut butter",
        "Chia seeds",
        "Sliced almonds",
        "Dark chocolate chips"
      ],
      "prepTime": "10 minutes",
      "calories": "120 per ball",
      "description": "Oat and Nut Energy Balls are a delicious and convenient snack, packed with nutrients and perfect for on-the-go moments. These bite-sized treats combine the heartiness of oats with the sweetness of honey and the crunch of nuts for a balanced energy boost.",
      "instructions": [
        "In a large bowl, combine 1 cup of rolled oats, 2 tablespoons of honey, 3 tablespoons of peanut butter, 1 tablespoon of chia seeds, 1/2 cup of sliced almonds, and 1/4 cup of dark chocolate chips.",
        "Mix all ingredients until well combined. If the mixture is too dry, add a little more peanut butter or honey.",
        "Using your hands, roll the mixture into small balls, approximately 1 inch in diameter.",
        "Place the energy balls on a baking sheet lined with parchment paper and refrigerate for at least 30 minutes to firm up."
      ],
      "benefits": "These energy balls are rich in fiber from oats and chia seeds, providing sustained energy release. The nuts and seeds add healthy fats and protein, which help keep you full and focused. They're also a great source of antioxidants from dark chocolate, making them not just delicious but also nutritious. Plus, they're easily portable, so you can enjoy them anytime, anywhere, even if your schedule is unpredictable.",
      "generatedAt": "2025-08-20T19:02:20.057Z",
      "id": "1755716540057",
      "isAIGenerated": true,
      "responseTimeMs": 139641
    },
    {
      "name": "Hummus and Whole Grain Pita Pocket",
      "type": "snack",
      "ingredients": [
        "whole grain pita bread",
        "hummus",
        "spinach",
        "cherry tomatoes",
        "cucumber"
      ],
      "prepTime": "5 minutes",
      "calories": "250",
      "description": "A delicious and nutritious whole grain pita pocket filled with hummus and fresh veggies.",
      "instructions": [
        "Cut the whole grain pita in half to open it up like a pocket.",
        "Spread a generous amount of hummus inside the pita.",
        "Add a handful of fresh spinach, some sliced cherry tomatoes, and cucumber sticks.",
        "Fold the pita pocket closed and enjoy!"
      ],
      "benefits": "This snack is packed with protein from hummus and fiber from whole grains and vegetables, providing sustained energy. It's easy to prepare and portable, making it perfect for busy schedules.",
      "generatedAt": "2025-08-21T19:01:29.354Z",
      "id": "1755802889354",
      "isAIGenerated": true,
      "responseTimeMs": 89244
    },
    {
      "name": "Celery and Cream Cheese with Raisins",
      "type": "snack",
      "ingredients": [
        "celery sticks",
        "cream cheese",
        "raisins"
      ],
      "prepTime": "5 minutes",
      "calories": "150",
      "description": "A simple, creamy snack with a sweet twist, combining crunchy celery with rich cream cheese and chewy raisins.",
      "instructions": [
        "Wash and trim the ends of the celery sticks.",
        "Spread a generous layer of cream cheese on each celery stick.",
        "Top each stick with a few raisins."
      ],
      "benefits": "This snack is a great balance of carbohydrates, protein, and healthy fats. Celery provides crunch and fiber, cream cheese offers protein and fat for satiety, and raisins add natural sweetness and quick energy. It's easy to prepare, portable, and perfect for maintaining energy levels throughout a busy day.",
      "generatedAt": "2025-08-22T19:01:28.819Z",
      "id": "1755889288819",
      "isAIGenerated": true,
      "responseTimeMs": 87957
    },
    {
      "name": "Hummus and Carrot Sticks with Almonds",
      "type": "snack",
      "ingredients": [
        "hummus",
        "carrot sticks",
        "raw almonds"
      ],
      "prepTime": "5 minutes",
      "calories": "200",
      "description": "A crunchy and satisfying snack that combines the creamy goodness of hummus with fresh carrot sticks and the protein-rich crunch of almonds.",
      "instructions": [
        "Wash and cut the carrots into sticks.",
        "Scoop a portion of hummus into a small container or wrap.",
        "Add a small handful of raw almonds to the container or wrap.",
        "Pack everything in a portable snack bag or container."
      ],
      "benefits": "This snack is rich in protein from the hummus and almonds, which helps sustain energy levels. Carrot sticks provide dietary fiber and essential vitamins, while almonds contribute healthy fats and additional protein, making it a balanced and nutritious option for busy schedules.",
      "generatedAt": "2025-08-23T19:01:32.983Z",
      "id": "1755975692983",
      "isAIGenerated": true,
      "responseTimeMs": 92413
    },
    {
      "name": "Cottage Cheese and Pineapple Bites",
      "type": "snack",
      "ingredients": [
        "cottage cheese",
        "fresh pineapple"
      ],
      "prepTime": "5 minutes",
      "calories": "150",
      "description": "A refreshing and protein-packed snack combining cottage cheese with sweet pineapple chunks.",
      "instructions": [
        "Cut a fresh pineapple into bite-sized chunks.",
        "In a small bowl, combine the pineapple with a portion of cottage cheese.",
        "Mix gently to ensure the pineapple is well-coated.",
        "Transfer to a portable container for easy transport."
      ],
      "benefits": "This snack is perfect for sustained energy due to the combination of protein from cottage cheese and natural sugars from pineapple, which provide a balanced energy boost. Cottage cheese is also rich in casein, a slow-digesting protein, which helps keep you full longer. Pineapple adds a refreshing sweetness and is packed with vitamins and antioxidants, making it a nutritious choice for those with busy schedules.",
      "generatedAt": "2025-08-24T19:01:33.558Z",
      "id": "1756062093558",
      "isAIGenerated": true,
      "responseTimeMs": 93462
    },
    {
      "name": "Hummus and Bell Pepper Bites",
      "type": "snack",
      "ingredients": [
        "hummus",
        "red bell pepper"
      ],
      "prepTime": "5 minutes",
      "calories": "150",
      "description": "Crunchy bell pepper slices paired with creamy hummus for a protein-packed snack.",
      "instructions": [
        "Wash and slice the red bell pepper into bite-sized sticks.",
        "Scoop out a tablespoon of hummus.",
        "Serve the hummus with the bell pepper slices for dipping or spreading."
      ],
      "benefits": "This snack is rich in protein from the hummus, providing sustained energy and satiety. The bell pepper adds a dose of vitamins A and C, as well as fiber, making it both nutritious and satisfying. It's easy to prepare, portable, and perfect for busy schedules.",
      "generatedAt": "2025-08-25T19:01:24.819Z",
      "id": "1756148484819",
      "isAIGenerated": true,
      "responseTimeMs": 84692
    },
    {
      "name": "Veggie and Hummus Roll-Ups",
      "type": "snack",
      "ingredients": [
        "Whole Wheat Tortilla",
        "Hummus",
        "Cucumber",
        "Red Bell Pepper",
        "Carrot",
        "Spinach"
      ],
      "prepTime": "5 minutes",
      "calories": "150",
      "description": "A refreshing and nutritious snack featuring crunchy veggies wrapped in a soft tortilla with creamy hummus.",
      "instructions": [
        "Spread a generous layer of hummus on a whole wheat tortilla.",
        "Place thin slices of cucumber, red bell pepper, carrot, and a few spinach leaves on top of the hummus.",
        "Roll the tortilla tightly from one end to the other.",
        "Slice the roll into bite-sized pieces and wrap each piece in parchment paper for portability."
      ],
      "benefits": "This snack is rich in fiber, protein, and healthy fats, which provide sustained energy and help keep you full between meals. The combination of vegetables and hummus ensures a good balance of vitamins and minerals, while the whole wheat tortilla adds complex carbohydrates for lasting energy.",
      "generatedAt": "2025-08-26T19:01:42.315Z",
      "id": "1756234902315",
      "isAIGenerated": true,
      "responseTimeMs": 101639
    },
    {
      "name": "Apple and Almond Butter Bites",
      "type": "snack",
      "ingredients": [
        "apple",
        "almond butter"
      ],
      "prepTime": "5 minutes",
      "calories": "180",
      "description": "Crunchy apple slices paired with creamy almond butter for a satisfying and energizing snack.",
      "instructions": [
        "Wash and core an apple.",
        "Slice the apple into bite-sized pieces.",
        "Spread almond butter on each apple slice."
      ],
      "benefits": "Apples provide natural sweetness and fiber, which helps maintain energy levels and keep you feeling full. Almond butter offers healthy fats and protein, supporting sustained energy and satiety, making it perfect for busy schedules.",
      "generatedAt": "2025-08-27T19:01:16.839Z",
      "id": "1756321276839",
      "isAIGenerated": true,
      "responseTimeMs": 76548
    },
    {
      "name": "Spinach and Feta Stuffed Mini Peppers",
      "type": "snack",
      "ingredients": [
        "Mini bell peppers",
        "Feta cheese",
        "Fresh spinach",
        "Olive oil",
        "Salt and pepper"
      ],
      "prepTime": "8 minutes",
      "calories": "70 per serving",
      "description": "A delicious and nutritious snack featuring mini bell peppers stuffed with a savory mixture of feta cheese and fresh spinach, seasoned with olive oil, salt, and pepper.",
      "instructions": [
        "Preheat the oven to 375°F (190°C).",
        "Wash and dry mini bell peppers. Cut off the tops and remove the seeds.",
        "In a small bowl, crumble feta cheese and mix with chopped fresh spinach. Add a drizzle of olive oil, and season with salt and pepper.",
        "Stuff each mini pepper with the feta and spinach mixture.",
        "Place the stuffed peppers on a baking sheet and bake for about 5-7 minutes or until the peppers are tender and the cheese is slightly melted."
      ],
      "benefits": "This snack is packed with protein from feta cheese and iron from spinach, providing sustained energy. The mini bell peppers are rich in vitamins A and C, while the olive oil offers healthy fats for satiety. It's easy to prepare, portable, and perfect for a quick energy boost during a busy day.",
      "generatedAt": "2025-08-28T19:02:01.012Z",
      "id": "1756407721012",
      "isAIGenerated": true,
      "responseTimeMs": 120947
    },
    {
      "name": "Greek Yogurt Parfait with Honey and Walnuts",
      "type": "snack",
      "ingredients": [
        "plain Greek yogurt",
        "honey",
        "walnuts"
      ],
      "prepTime": "5 minutes",
      "calories": "200",
      "description": "A creamy, protein-rich snack layered with sweet honey and crunchy walnuts.",
      "instructions": [
        "In a small bowl or portable container, layer plain Greek yogurt.",
        "Drizzle a teaspoon of honey over the yogurt.",
        "Top with a small handful of chopped walnuts."
      ],
      "benefits": "This snack is rich in protein from the Greek yogurt, which helps sustain energy levels and keeps you feeling full. The honey provides quick energy with natural sugars, while the walnuts offer healthy fats and a bit of crunch for satisfaction. It's quick to prepare, portable, and provides a balanced mix of macronutrients.",
      "generatedAt": "2025-08-29T19:01:27.528Z",
      "id": "1756494087528",
      "isAIGenerated": true,
      "responseTimeMs": 87413
    },
    {
      "name": "Banana and Nut Butter Wrap",
      "type": "snack",
      "ingredients": [
        "1 medium banana",
        "1 tablespoon of almond butter or peanut butter",
        "1 whole grain tortilla"
      ],
      "prepTime": "5 minutes",
      "calories": "250",
      "description": "A quick and satisfying snack combining the natural sweetness of banana with the protein and healthy fats of nut butter, all wrapped up in a whole grain tortilla for added fiber.",
      "instructions": [
        "Peel the banana and spread the nut butter evenly over it.",
        "Place the banana on the tortilla.",
        "Roll the tortilla tightly around the banana.",
        "Slice the wrap in half for easy handling."
      ],
      "benefits": "This snack provides a balance of carbohydrates, protein, and healthy fats, making it ideal for sustained energy throughout the day. Bananas offer quick energy from natural sugars and fiber, while nut butter contributes protein and healthy fats for satiety. The whole grain tortilla adds fiber, supporting digestive health and keeping you full longer.",
      "generatedAt": "2025-08-30T19:01:39.669Z",
      "id": "1756580499669",
      "isAIGenerated": true,
      "responseTimeMs": 99254
    },
    {
      "name": "Edamame and Sunflower Seed Snack Mix",
      "type": "snack",
      "ingredients": [
        "shelled edamame",
        "sunflower seeds",
        "a pinch of sea salt"
      ],
      "prepTime": "5 minutes",
      "calories": "150",
      "description": "A crunchy, protein-packed snack that is both energizing and satisfying.",
      "instructions": [
        "Rinse 1/4 cup of shelled edamame under cold water and drain.",
        "Mix the edamame with 1 tablespoon of sunflower seeds in a small bowl.",
        "Add a pinch of sea salt to taste and mix well.",
        "Transfer to a portable container for on-the-go snacking."
      ],
      "benefits": "This snack is rich in protein and fiber from the edamame, which helps in maintaining energy levels and keeping you full longer. Sunflower seeds add healthy fats and essential vitamins, making it a balanced, nutritious choice for busy schedules.",
      "generatedAt": "2025-09-09T19:01:33.545Z",
      "id": "1757444493545",
      "isAIGenerated": true,
      "responseTimeMs": 92734
    },
    {
      "name": "Chia Seed and Berry Yogurt Parfait",
      "type": "snack",
      "ingredients": [
        "Greek yogurt",
        "chia seeds",
        "mixed berries (strawberries, blueberries, raspberries)",
        "honey or agave syrup"
      ],
      "prepTime": "5 minutes",
      "calories": "200",
      "description": "A delightful combination of creamy Greek yogurt, nutrient-packed chia seeds, and fresh berries, sweetened with a touch of honey or agave syrup.",
      "instructions": [
        "In a small bowl or portable container, add a layer of Greek yogurt.",
        "Sprinkle a teaspoon of chia seeds over the yogurt.",
        "Add a layer of mixed berries on top.",
        "Repeat the layers until the container is filled.",
        "Drizzle a small amount of honey or agave syrup over the top for added sweetness."
      ],
      "benefits": "This snack is rich in protein from the Greek yogurt, providing sustained energy. Chia seeds add fiber, omega-3 fatty acids, and essential nutrients, while berries offer antioxidants and natural sweetness. It's easy to prepare, portable, and perfect for busy schedules.",
      "generatedAt": "2025-09-10T19:01:45.026Z",
      "id": "1757530905026",
      "isAIGenerated": true,
      "responseTimeMs": 104052
    },
    {
      "name": "Turkey and Cheese Lettuce Wraps",
      "type": "snack",
      "ingredients": [
        "sliced turkey breast",
        "cheddar cheese slices",
        "lettuce leaves (e.g., butter or romaine)",
        "sliced cucumber"
      ],
      "prepTime": "5 minutes",
      "calories": "150 per wrap",
      "description": "A refreshing and protein-packed snack that’s easy to prepare and perfect for on-the-go lifestyles.",
      "instructions": [
        "Take a lettuce leaf and place a slice of turkey breast in the center.",
        "Add a slice of cheddar cheese on top of the turkey.",
        "Add a few slices of cucumber for extra crunch and freshness.",
        "Fold the lettuce leaf over the filling to create a wrap."
      ],
      "benefits": "This snack is rich in protein from the turkey and cheese, which helps sustain energy levels throughout the day. The lettuce and cucumber add fiber and hydration, making it a balanced and refreshing choice. It's also low in calories and carbs, ideal for maintaining energy without feeling sluggish.",
      "generatedAt": "2025-09-11T19:01:37.771Z",
      "id": "1757617297771",
      "isAIGenerated": true,
      "responseTimeMs": 97158
    }
  ],
  "lastGenerated": "2025-09-11T19:01:37.771Z"
}