{
  "snacks": [
    {
      "name": "Hummus and Veggie Sticks",
      "type": "snack",
      "ingredients": [
        "1 cup canned chickpeas",
        "2 tablespoons tahini",
        "1 tablespoon olive oil",
        "1 tablespoon lemon juice",
        "1 clove garlic",
        "Salt to taste",
        "1 carrot",
        "1 cucumber",
        "1 bell pepper"
      ],
      "prepTime": "8 minutes",
      "calories": "250",
      "description": "A refreshing and filling snack that combines homemade hummus with crunchy veggie sticks for a satisfying energy boost.",
      "instructions": [
        "Drain and rinse the chickpeas.",
        "In a food processor, combine chickpeas, tahini, olive oil, lemon juice, garlic, and salt. Blend until smooth.",
        "Wash and cut the carrot, cucumber, and bell pepper into sticks.",
        "Serve the hummus with the veggie sticks for dipping."
      ],
      "benefits": "This snack is rich in protein and fiber from the chickpeas and veggies, providing sustained energy. It's low in calories but highly nutritious, making it perfect for busy schedules. The hummus and veggies are portable and easy to eat on the go, ensuring you stay energized throughout your day.",
      "generatedAt": "2025-07-03T19:01:48.771Z",
      "id": "1751569308771",
      "isAIGenerated": true
    },
    {
      "name": "Apple Peanut Butter Bites",
      "type": "snack",
      "ingredients": [
        "apples",
        "natural peanut butter",
        "chia seeds"
      ],
      "prepTime": "5 minutes",
      "calories": "150 per serving",
      "description": "Simple and satisfying apple slices topped with peanut butter and chia seeds, perfect for an on-the-go energy boost.",
      "instructions": [
        "Wash and core the apples, then slice them into thin wedges.",
        "Spread a thin layer of natural peanut butter over each apple slice.",
        "Sprinkle a small amount of chia seeds on top of the peanut butter for added crunch and nutrition.",
        "Arrange the apple bites on a plate or in a portable container for easy snacking."
      ],
      "benefits": "This snack combines the fiber and natural sugars from apples with the protein and healthy fats from peanut butter, providing a balanced mix of nutrients to keep you energized and focused. The chia seeds add omega-3 fatty acids and additional fiber, making it a wholesome and filling option suitable for busy schedules.",
      "generatedAt": "2025-07-03T20:01:39.781Z",
      "id": "1751572899781",
      "isAIGenerated": true
    },
    {
      "name": "Greek Yogurt and Berry Parfait",
      "type": "snack",
      "ingredients": [
        "Greek yogurt",
        "mixed berries (e.g., strawberries, blueberries, raspberries)",
        "chia seeds"
      ],
      "prepTime": "5 minutes",
      "calories": "180",
      "description": "A refreshing and nutritious snack combining creamy Greek yogurt, antioxidant-rich berries, and fiber-packed chia seeds.",
      "instructions": [
        "In a small container or jar, layer a scoop of Greek yogurt.",
        "Add a handful of mixed berries and sprinkle some chia seeds.",
        "Repeat the layers as desired, finishing with berries and chia seeds on top."
      ],
      "benefits": "This snack is packed with protein from the Greek yogurt, providing sustained energy. The berries offer antioxidants and vitamins, while chia seeds contribute fiber and omega-3 fatty acids, supporting digestion and heart health. It's easy to prepare, portable, and perfect for busy schedules.",
      "generatedAt": "2025-07-04T13:31:28.603Z",
      "id": "1751635888603",
      "isAIGenerated": true
    },
    {
      "name": "Almond Butter Banana Roll-Ups",
      "type": "snack",
      "ingredients": [
        "Whole grain tortilla",
        "Almond butter",
        "Banana"
      ],
      "prepTime": "5 minutes",
      "calories": "250",
      "description": "A quick, portable snack featuring a whole grain tortilla spread with almond butter and rolled with banana slices.",
      "instructions": [
        "Lay a whole grain tortilla flat on a clean surface.",
        "Spread a thin layer of almond butter evenly across the tortilla.",
        "Slice a banana into thin rounds and place them along the edge of the tortilla.",
        "Carefully roll the tortilla from the edge with the banana slices, forming a tight roll.",
        "Slice the roll into bite-sized pieces for easy eating on the go."
      ],
      "benefits": "This snack combines complex carbohydrates from the whole grain tortilla, healthy fats from the almond butter, and natural sugars and fiber from the banana. This combination helps maintain energy levels, supports satiety, and provides essential nutrients, making it ideal for busy schedules.",
      "generatedAt": "2025-07-04T19:01:36.940Z",
      "id": "1751655696940",
      "isAIGenerated": true
    }
  ],
  "lastGenerated": "2025-07-04T19:01:36.940Z"
}