{
  "snacks": [
    {
      "name": "Hummus and Veggie Sticks",
      "type": "snack",
      "ingredients": [
        "1 cup canned chickpeas",
        "2 tablespoons tahini",
        "1 tablespoon olive oil",
        "1 tablespoon lemon juice",
        "1 clove garlic",
        "Salt to taste",
        "1 carrot",
        "1 cucumber",
        "1 bell pepper"
      ],
      "prepTime": "8 minutes",
      "calories": "250",
      "description": "A refreshing and filling snack that combines homemade hummus with crunchy veggie sticks for a satisfying energy boost.",
      "instructions": [
        "Drain and rinse the chickpeas.",
        "In a food processor, combine chickpeas, tahini, olive oil, lemon juice, garlic, and salt. Blend until smooth.",
        "Wash and cut the carrot, cucumber, and bell pepper into sticks.",
        "Serve the hummus with the veggie sticks for dipping."
      ],
      "benefits": "This snack is rich in protein and fiber from the chickpeas and veggies, providing sustained energy. It's low in calories but highly nutritious, making it perfect for busy schedules. The hummus and veggies are portable and easy to eat on the go, ensuring you stay energized throughout your day.",
      "generatedAt": "2025-07-03T19:01:48.771Z",
      "id": "1751569308771",
      "isAIGenerated": true
    },
    {
      "name": "Apple Peanut Butter Bites",
      "type": "snack",
      "ingredients": [
        "apples",
        "natural peanut butter",
        "chia seeds"
      ],
      "prepTime": "5 minutes",
      "calories": "150 per serving",
      "description": "Simple and satisfying apple slices topped with peanut butter and chia seeds, perfect for an on-the-go energy boost.",
      "instructions": [
        "Wash and core the apples, then slice them into thin wedges.",
        "Spread a thin layer of natural peanut butter over each apple slice.",
        "Sprinkle a small amount of chia seeds on top of the peanut butter for added crunch and nutrition.",
        "Arrange the apple bites on a plate or in a portable container for easy snacking."
      ],
      "benefits": "This snack combines the fiber and natural sugars from apples with the protein and healthy fats from peanut butter, providing a balanced mix of nutrients to keep you energized and focused. The chia seeds add omega-3 fatty acids and additional fiber, making it a wholesome and filling option suitable for busy schedules.",
      "generatedAt": "2025-07-03T20:01:39.781Z",
      "id": "1751572899781",
      "isAIGenerated": true
    },
    {
      "name": "Greek Yogurt and Berry Parfait",
      "type": "snack",
      "ingredients": [
        "Greek yogurt",
        "mixed berries (e.g., strawberries, blueberries, raspberries)",
        "chia seeds"
      ],
      "prepTime": "5 minutes",
      "calories": "180",
      "description": "A refreshing and nutritious snack combining creamy Greek yogurt, antioxidant-rich berries, and fiber-packed chia seeds.",
      "instructions": [
        "In a small container or jar, layer a scoop of Greek yogurt.",
        "Add a handful of mixed berries and sprinkle some chia seeds.",
        "Repeat the layers as desired, finishing with berries and chia seeds on top."
      ],
      "benefits": "This snack is packed with protein from the Greek yogurt, providing sustained energy. The berries offer antioxidants and vitamins, while chia seeds contribute fiber and omega-3 fatty acids, supporting digestion and heart health. It's easy to prepare, portable, and perfect for busy schedules.",
      "generatedAt": "2025-07-04T13:31:28.603Z",
      "id": "1751635888603",
      "isAIGenerated": true
    },
    {
      "name": "Almond Butter Banana Roll-Ups",
      "type": "snack",
      "ingredients": [
        "Whole grain tortilla",
        "Almond butter",
        "Banana"
      ],
      "prepTime": "5 minutes",
      "calories": "250",
      "description": "A quick, portable snack featuring a whole grain tortilla spread with almond butter and rolled with banana slices.",
      "instructions": [
        "Lay a whole grain tortilla flat on a clean surface.",
        "Spread a thin layer of almond butter evenly across the tortilla.",
        "Slice a banana into thin rounds and place them along the edge of the tortilla.",
        "Carefully roll the tortilla from the edge with the banana slices, forming a tight roll.",
        "Slice the roll into bite-sized pieces for easy eating on the go."
      ],
      "benefits": "This snack combines complex carbohydrates from the whole grain tortilla, healthy fats from the almond butter, and natural sugars and fiber from the banana. This combination helps maintain energy levels, supports satiety, and provides essential nutrients, making it ideal for busy schedules.",
      "generatedAt": "2025-07-04T19:01:36.940Z",
      "id": "1751655696940",
      "isAIGenerated": true
    },
    {
      "name": "Chia Seed Energy Balls",
      "type": "snack",
      "ingredients": [
        "1/2 cup rolled oats",
        "1/4 cup chia seeds",
        "1/4 cup nut butter (almond or peanut)",
        "1/4 cup honey or maple syrup",
        "1/2 cup dried fruit (like cranberries or raisins)",
        "1/2 teaspoon vanilla extract"
      ],
      "prepTime": "10 minutes",
      "calories": "150 per ball",
      "description": "These no-bake energy balls are packed with fiber, healthy fats, and natural sweetness, making them perfect for a quick and satisfying snack.",
      "instructions": [
        "In a large bowl, combine rolled oats, chia seeds, nut butter, honey or maple syrup, dried fruit, and vanilla extract.",
        "Mix until all ingredients are well incorporated. If the mixture is too dry, add a little more nut butter or honey.",
        "Roll the mixture into small balls, about 1 inch in diameter.",
        "Place the balls on a parchment-lined tray and refrigerate for at least 30 minutes to firm up."
      ],
      "benefits": "Chia seeds are high in omega-3 fatty acids and fiber, providing sustained energy and keeping you full. The combination of oats and nut butter offers complex carbohydrates and protein for balanced nutrition. These energy balls are easy to prepare, portable, and can be made in advance.",
      "generatedAt": "2025-07-05T13:31:59.903Z",
      "id": "1751722319903",
      "isAIGenerated": true,
      "responseTimeMs": 119717
    },
    {
      "name": "Cottage Cheese and Pineapple Cups",
      "type": "snack",
      "ingredients": [
        "cottage cheese",
        "pineapple chunks"
      ],
      "prepTime": "5 minutes",
      "calories": "150",
      "description": "A refreshing and protein-rich snack perfect for keeping energy levels steady throughout the day.",
      "instructions": [
        "Scoop 1/2 cup of cottage cheese into a portable container or cup.",
        "Top with 1/4 cup of fresh or canned pineapple chunks."
      ],
      "benefits": "Cottage cheese provides high-quality protein and casein, which releases energy slowly, helping to keep hunger at bay. Pineapple offers natural sweetness, vitamins, and enzymes that aid digestion. This snack is easy to prepare, portable, and perfect for maintaining energy during busy days.",
      "generatedAt": "2025-07-05T19:01:17.851Z",
      "id": "1751742077851",
      "isAIGenerated": true,
      "responseTimeMs": 77664
    },
    {
      "name": "Nutty Oatmeal Energy Bites",
      "type": "snack",
      "ingredients": [
        "rolled oats",
        "honey",
        "peanut butter or almond butter",
        "chopped walnuts",
        "dried cranberries or raisins"
      ],
      "prepTime": "10 minutes",
      "calories": "150 per bite",
      "description": "These nutty oatmeal energy bites are a perfect on-the-go snack that combines wholesome oats, nut butter, and a mix of nuts and dried fruits for a burst of energy.",
      "instructions": [
        "In a mixing bowl, combine 1 cup of rolled oats, 2 tablespoons of honey, 2 tablespoons of peanut butter or almond butter, 1/2 cup of chopped walnuts, and 1/2 cup of dried cranberries or raisins.",
        "Mix well until all ingredients are fully incorporated.",
        "Using a small scoop or spoon, form the mixture into bite-sized balls.",
        "Place the energy bites on a baking sheet lined with parchment paper.",
        "Refrigerate for 30 minutes to firm up before storing in an airtight container."
      ],
      "benefits": "These energy bites are rich in fiber from oats, healthy fats from nuts, and natural sugars from honey and dried fruits, providing a balanced source of energy. They're also easy to prepare and portable, making them ideal for busy schedules.",
      "generatedAt": "2025-07-06T13:31:58.640Z",
      "id": "1751808718640",
      "isAIGenerated": true,
      "responseTimeMs": 117730
    },
    {
      "name": "Quinoa Crunch Mix",
      "type": "snack",
      "ingredients": [
        "quinoa",
        "sunflower seeds",
        "raisins",
        "honey",
        "cinnamon"
      ],
      "prepTime": "10 minutes",
      "calories": "150 per serving",
      "description": "A delightful and crunchy snack mix combining the nutty flavor of quinoa with the sweetness of raisins and a hint of cinnamon.",
      "instructions": [
        "Rinse 1 cup of quinoa under cold water and drain.",
        "In a small saucepan, combine the quinoa with 2 cups of water. Bring to a boil, then reduce heat and simmer for 15 minutes, or until quinoa is cooked and water is absorbed. Let it cool slightly.",
        "In a bowl, mix 1 tablespoon of honey with 1 teaspoon of cinnamon.",
        "Combine the cooked quinoa with 1/2 cup of sunflower seeds and 1/4 cup of raisins in a large bowl.",
        "Drizzle the honey-cinnamon mixture over the quinoa mix and toss to coat evenly.",
        "Spread the mixture on a baking sheet and bake in a preheated oven at 350°F (175°C) for about 10 minutes, stirring halfway through until golden and crispy. Let it cool before serving."
      ],
      "benefits": "This snack is a great source of protein and fiber from quinoa and sunflower seeds, which help sustain energy levels throughout the day. The natural sugars from raisins provide a quick energy boost, while the honey and cinnamon add flavor without excessive sugar. It's portable, easy to prepare in advance, and perfect for on-the-go snacking.",
      "generatedAt": "2025-07-06T19:02:19.996Z",
      "id": "1751828539996",
      "isAIGenerated": true,
      "responseTimeMs": 139198
    },
    {
      "name": "Avocado Toast Cups",
      "type": "snack",
      "ingredients": [
        "whole grain tortilla wraps",
        "ripe avocado",
        "hard-boiled eggs",
        "cherry tomatoes",
        "salt",
        "pepper"
      ],
      "prepTime": "8 minutes",
      "calories": "150",
      "description": "A portable and nutritious snack featuring creamy avocado and protein-rich eggs in tortilla cups.",
      "instructions": [
        "Cut the tortilla wraps into quarters to form cups.",
        "Mash the ripe avocado and season with salt and pepper.",
        "Scoop the avocado mixture into the tortilla cups.",
        "Slice the hard-boiled eggs and cherry tomatoes into small pieces.",
        "Top the avocado with egg and tomato pieces.",
        "Serve immediately or pack for later."
      ],
      "benefits": "This snack is packed with healthy fats from avocado, protein from eggs, and fiber from whole grain tortillas, providing sustained energy and keeping you full longer. It's quick to prepare and perfect for on-the-go eating.",
      "generatedAt": "2025-07-07T13:31:33.928Z",
      "id": "1751895093928",
      "isAIGenerated": true,
      "responseTimeMs": 93007
    },
    {
      "name": "Caprese Skewers",
      "type": "snack",
      "ingredients": [
        "cherry tomatoes",
        "fresh mozzarella balls",
        "basil leaves",
        "olive oil",
        "balsamic glaze"
      ],
      "prepTime": "5 minutes",
      "calories": "150",
      "description": "A refreshing and savory snack featuring cherry tomatoes, mozzarella, and basil drizzled with olive oil and balsamic glaze.",
      "instructions": [
        "Wash and pat dry cherry tomatoes.",
        "Skewer a cherry tomato, a basil leaf, and a mozzarella ball onto a small skewer stick.",
        "Drizzle with a small amount of olive oil and balsamic glaze.",
        "Repeat until all ingredients are used."
      ],
      "benefits": "Caprese Skewers provide a balanced mix of protein from the mozzarella, healthy fats from the olive oil, and carbohydrates from the tomatoes. This combination helps sustain energy levels and is easy to prepare and consume on the go. The fresh ingredients also make it a hydrating and satisfying snack.",
      "generatedAt": "2025-07-07T19:01:38.010Z",
      "id": "1751914898010",
      "isAIGenerated": true,
      "responseTimeMs": 97379
    },
    {
      "name": "Cucumber and Turkey Roll-Ups",
      "type": "snack",
      "ingredients": [
        "sliced cucumber",
        "sliced turkey breast",
        "cream cheese",
        "optional: fresh dill or chives"
      ],
      "prepTime": "5 minutes",
      "calories": "150 per serving",
      "description": "A refreshing and satisfying snack that combines the crispness of cucumber with the protein-rich turkey, enhanced with a creamy spread.",
      "instructions": [
        "Spread a thin layer of cream cheese over each slice of turkey.",
        "Place a cucumber slice on one end of the turkey slice.",
        "Roll the turkey slice around the cucumber.",
        "Secure with a toothpick if desired, and garnish with dill or chives if using."
      ],
      "benefits": "This snack is high in protein and healthy fats from the turkey and cream cheese, which help sustain energy levels. The cucumber adds hydration and essential vitamins, making it a balanced and satisfying option for busy schedules.",
      "generatedAt": "2025-07-08T13:31:31.330Z",
      "id": "1751981491330",
      "isAIGenerated": true,
      "responseTimeMs": 91085
    },
    {
      "name": "Protein-Packed Edamame Salad",
      "type": "snack",
      "ingredients": [
        "shelled edamame",
        "feta cheese",
        "lemon juice",
        "olive oil",
        "salt",
        "pepper",
        "parsley"
      ],
      "prepTime": "8 minutes",
      "calories": "150",
      "description": "A refreshing and savory snack combining edamame with feta for a protein-rich bite.",
      "instructions": [
        "Combine shelled edamame and crumbled feta cheese in a bowl.",
        "In a small bowl, whisk together lemon juice, olive oil, salt, and pepper.",
        "Pour the dressing over the edamame and feta, toss to coat.",
        "Garnish with freshly chopped parsley."
      ],
      "benefits": "Edamame provides plant-based protein and fiber, which help in maintaining energy levels. Feta adds a savory flavor and additional protein, while the lemon and olive oil dressing offers healthy fats and a refreshing taste. This snack is easy to prepare, portable, and ideal for a quick energy boost during busy days.",
      "generatedAt": "2025-07-08T19:01:42.985Z",
      "id": "1752001302985",
      "isAIGenerated": true,
      "responseTimeMs": 102321
    }
  ],
  "lastGenerated": "2025-07-08T19:01:42.985Z"
}