{
  "snacks": [
    {
      "name": "Chia Seed Pudding Parfait",
      "type": "snack",
      "ingredients": [
        "2 tablespoons chia seeds",
        "1/2 cup unsweetened almond milk",
        "1 tablespoon honey or maple syrup",
        "1/2 cup mixed berries (fresh or frozen)",
        "1 tablespoon nuts (almonds, walnuts, or pecans)"
      ],
      "prepTime": "5 minutes",
      "calories": "250",
      "description": "A creamy, delicious parfait made with chia seeds and mixed berries, perfect for a quick energy boost.",
      "instructions": [
        "In a small bowl or mason jar, mix chia seeds, almond milk, and honey.",
        "Stir well to combine and let sit for 5 minutes to thicken.",
        "Layer with mixed berries and nuts on top.",
        "Store in the refrigerator until ready to eat."
      ],
      "benefits": "Chia seeds are packed with fiber, protein, and omega-3 fatty acids, providing sustained energy. Berries offer antioxidants, while nuts give healthy fats and additional protein, making this snack balanced and satisfying.",
      "generatedAt": "2025-09-27T19:01:51.991Z",
      "id": "1758999711991",
      "isAIGenerated": true,
      "responseTimeMs": 111901
    },
    {
      "name": "Apple Slices with Almond Butter",
      "type": "snack",
      "ingredients": [
        "1 medium apple",
        "2 tablespoons almond butter"
      ],
      "prepTime": "5 minutes",
      "calories": "220",
      "description": "A simple and delicious snack featuring apple slices paired with almond butter for a satisfying and nutritious treat.",
      "instructions": [
        "Wash and core the apple.",
        "Slice the apple into even pieces.",
        "Place the almond butter in a small container or wrap it in parchment paper.",
        "Serve apple slices with almond butter for dipping."
      ],
      "benefits": "This snack provides a balanced mix of carbohydrates, protein, and healthy fats, making it ideal for sustained energy. The fiber from the apple helps keep you full, while the almond butter offers protein and healthy fats for a steady energy release. It's quick to prepare, portable, and perfect for busy schedules.",
      "generatedAt": "2025-09-28T19:01:34.587Z",
      "id": "1759086094587",
      "isAIGenerated": true,
      "responseTimeMs": 94238
    },
    {
      "name": "Roasted Chickpea Trail Mix",
      "type": "snack",
      "ingredients": [
        "1 cup canned chickpeas, drained and rinsed",
        "1 tablespoon olive oil",
        "1/2 teaspoon paprika",
        "1/2 teaspoon garlic powder",
        "1/4 teaspoon salt",
        "2 tablespoons mixed nuts (e.g., almonds, walnuts)",
        "2 tablespoons dried cranberries",
        "1 tablespoon pumpkin seeds"
      ],
      "prepTime": "8 minutes",
      "calories": "350",
      "description": "A savory and sweet snack mix that combines roasted chickpeas with nuts, seeds, and dried fruit for a balanced energy boost.",
      "instructions": [
        "Preheat oven to 400째F (200째C).",
        "Spread chickpeas on a baking sheet, drizzle with olive oil, and toss with paprika, garlic powder, and salt.",
        "Roast for 20-25 minutes, stirring halfway through, until crispy.",
        "Let chickpeas cool, then mix with nuts, cranberries, and pumpkin seeds."
      ],
      "benefits": "This snack is rich in protein, fiber, and healthy fats, providing sustained energy. Chickpeas offer plant-based protein and fiber, while nuts and seeds contribute essential fats and micronutrients. Dried fruit adds a touch of sweetness and quick energy, making it ideal for busy schedules.",
      "generatedAt": "2025-10-01T19:02:15.955Z",
      "id": "1759345335955",
      "isAIGenerated": true,
      "responseTimeMs": 135615
    },
    {
      "name": "Avocado Toast with Egg",
      "type": "snack",
      "ingredients": [
        "1 slice whole grain bread",
        "1/2 ripe avocado",
        "1 egg",
        "Salt and pepper to taste"
      ],
      "prepTime": "8 minutes",
      "calories": "250",
      "description": "A quick and portable snack that combines healthy fats, protein, and whole grains for sustained energy.",
      "instructions": [
        "Toast the slice of whole grain bread.",
        "While the bread is toasting, cook the egg to your liking (either scrambled or poached).",
        "Mash the avocado and spread it on the toasted bread.",
        "Top the avocado with the cooked egg and season with salt and pepper."
      ],
      "benefits": "Avocado provides healthy fats for sustained energy, while the egg offers high-quality protein to keep you full. Whole grain bread adds fiber for digestion and steady energy release, making it ideal for busy schedules.",
      "generatedAt": "2025-10-02T19:01:38.638Z",
      "id": "1759431698638",
      "isAIGenerated": true,
      "responseTimeMs": 98415
    },
    {
      "name": "Greek Yogurt and Berries with Honey",
      "type": "snack",
      "ingredients": [
        "plain Greek yogurt",
        "mixed berries (such as blueberries, strawberries, raspberries)",
        "honey"
      ],
      "prepTime": "5 minutes",
      "calories": "150",
      "description": "A delicious and creamy snack that combines protein-rich Greek yogurt with antioxidant-packed berries and a touch of natural sweetness from honey.",
      "instructions": [
        "Scoop a serving of plain Greek yogurt into a small bowl or container.",
        "Top with a generous handful of mixed berries.",
        "Drizzle a teaspoon of honey over the top and gently mix to combine."
      ],
      "benefits": "This snack is excellent for sustained energy due to its high protein content from Greek yogurt, which keeps you full longer. The berries provide fiber and antioxidants, supporting overall health and energy levels, while honey offers a quick natural energy boost. It's portable and can be prepared in advance for a convenient on-the-go option.",
      "generatedAt": "2025-10-03T19:01:41.295Z",
      "id": "1759518101295",
      "isAIGenerated": true,
      "responseTimeMs": 100328
    },
    {
      "name": "Hummus and Veggie Sticks",
      "type": "snack",
      "ingredients": [
        "hummus",
        "carrot sticks",
        "celery sticks",
        "cucumber slices"
      ],
      "prepTime": "5 minutes",
      "calories": "150",
      "description": "A refreshing and satisfying snack combining creamy hummus with crunchy vegetable sticks.",
      "instructions": [
        "Wash and peel the carrot, celery, and cucumber.",
        "Cut them into sticks or slices.",
        "Serve with a small portion of hummus."
      ],
      "benefits": "This snack provides a balanced mix of protein, fiber, and healthy fats from the hummus, while the vegetables offer vitamins and hydration. The combination helps sustain energy levels and keeps you feeling full longer, making it ideal for busy schedules.",
      "generatedAt": "2025-10-04T19:01:44.525Z",
      "id": "1759604504525",
      "isAIGenerated": true,
      "responseTimeMs": 104255
    },
    {
      "name": "Banana Nut Oatmeal Bites",
      "type": "snack",
      "ingredients": [
        "1 ripe banana",
        "1/2 cup rolled oats",
        "2 tablespoons chopped walnuts",
        "1 tablespoon honey",
        "1 teaspoon cinnamon"
      ],
      "prepTime": "10 minutes",
      "calories": "150 per bite",
      "description": "These no-bake banana nut oatmeal bites are a delicious, portable snack that provides sustained energy with the perfect balance of sweetness and crunch.",
      "instructions": [
        "Mash the banana in a bowl until smooth.",
        "Add rolled oats, chopped walnuts, honey, and cinnamon to the mashed banana. Mix until well combined.",
        "Scoop a tablespoon of the mixture and roll it into a ball with your hands.",
        "Place the bites on a parchment-lined tray and refrigerate for at least 30 minutes to set."
      ],
      "benefits": "Banana provides natural sugars and potassium for quick energy and muscle function. Rolled oats offer complex carbohydrates and fiber for sustained energy release. Walnuts add healthy fats and protein, supporting brain health and satiety. This snack is easy to prepare, portable, and ideal for busy schedules.",
      "generatedAt": "2025-10-06T19:02:07.796Z",
      "id": "1759777327796",
      "isAIGenerated": true,
      "responseTimeMs": 127533
    },
    {
      "name": "Nutty Quinoa Energy Balls",
      "type": "snack",
      "ingredients": [
        "quinoa (cooked and cooled)",
        "honey",
        "rolled oats",
        "peanut butter",
        "dark chocolate chips",
        "chia seeds"
      ],
      "prepTime": "10 minutes",
      "calories": "150 per ball",
      "description": "These Nutty Quinoa Energy Balls are a portable and nutritious snack, perfect for busy schedules. They combine the protein-rich quinoa with the satisfying crunch of oats and the sweetness of honey and dark chocolate.",
      "instructions": [
        "In a large bowl, mix together 1 cup cooked and cooled quinoa, 2 tablespoons honey, 1/2 cup rolled oats, 1/4 cup peanut butter, 1/4 cup dark chocolate chips, and 1 tablespoon chia seeds.",
        "Using your hands or a spoon, form the mixture into small, bite-sized balls.",
        "Place the balls on a plate and refrigerate for at least 30 minutes to set."
      ],
      "benefits": "These energy balls are packed with protein, fiber, and healthy fats, providing sustained energy throughout the day. The quinoa offers essential amino acids, while the oats and chia seeds contribute to satiety. The honey and dark chocolate add a touch of sweetness, making this snack both delicious and energizing.",
      "generatedAt": "2025-10-07T19:02:11.063Z",
      "id": "1759863731063",
      "isAIGenerated": true,
      "responseTimeMs": 130837
    },
    {
      "name": "Cucumber and Cottage Cheese Bites",
      "type": "snack",
      "ingredients": [
        "cucumber",
        "cottage cheese",
        "sunflower seeds",
        "fresh dill"
      ],
      "prepTime": "5 minutes",
      "calories": "60 per bite",
      "description": "Crunchy cucumber rounds topped with creamy cottage cheese and a sprinkle of sunflower seeds and dill.",
      "instructions": [
        "Wash and slice the cucumber into 1/4 inch thick rounds.",
        "Top each cucumber slice with a small spoonful of cottage cheese.",
        "Sprinkle sunflower seeds and a little dill on top for added flavor and crunch.",
        "Serve immediately or pack for on-the-go snacking."
      ],
      "benefits": "This snack is rich in protein and healthy fats from the cottage cheese and sunflower seeds, providing sustained energy. Cucumbers add hydration and fiber, while dill offers a refreshing flavor. It's quick to prepare, portable, and perfect for busy schedules.",
      "generatedAt": "2025-10-08T19:03:21.265Z",
      "id": "1759950201265",
      "isAIGenerated": true,
      "responseTimeMs": 201121
    },
    {
      "name": "Sweet Potato and Black Bean Bites",
      "type": "snack",
      "ingredients": [
        "sweet potato",
        "canned black beans",
        "olive oil",
        "cumin",
        "chili powder",
        "salt"
      ],
      "prepTime": "10 minutes",
      "calories": "150 per serving",
      "description": "A flavorful and filling snack that combines sweet potatoes with black beans, seasoned with spices and baked until crispy.",
      "instructions": [
        "Preheat your oven to 400째F (200째C).",
        "Peel and dice one small sweet potato into small cubes.",
        "Rinse and drain one can of black beans.",
        "In a bowl, mix the sweet potato cubes, black beans, 1 tablespoon of olive oil, 1/2 teaspoon of cumin, 1/2 teaspoon of chili powder, and a pinch of salt.",
        "Spread the mixture on a baking sheet lined with parchment paper.",
        "Bake for about 20 minutes, or until the sweet potatoes are tender and the edges are crispy.",
        "Let cool slightly before serving."
      ],
      "benefits": "Sweet potatoes are a great source of complex carbohydrates and fiber, providing sustained energy release. Black beans add protein and fiber, keeping you full longer. The spices add flavor without extra calories, making this a nutritious and satisfying snack for busy schedules.",
      "generatedAt": "2025-10-09T19:02:17.701Z",
      "id": "1760036537701",
      "isAIGenerated": true,
      "responseTimeMs": 137287
    }
  ],
  "lastGenerated": "2025-10-09T19:02:17.701Z"
}