{
  "snacks": [
    {
      "name": "Chia Seed Pudding Parfait",
      "type": "snack",
      "ingredients": [
        "2 tablespoons chia seeds",
        "1/2 cup unsweetened almond milk",
        "1 tablespoon honey or maple syrup",
        "1/2 cup mixed berries (fresh or frozen)",
        "1 tablespoon nuts (almonds, walnuts, or pecans)"
      ],
      "prepTime": "5 minutes",
      "calories": "250",
      "description": "A creamy, delicious parfait made with chia seeds and mixed berries, perfect for a quick energy boost.",
      "instructions": [
        "In a small bowl or mason jar, mix chia seeds, almond milk, and honey.",
        "Stir well to combine and let sit for 5 minutes to thicken.",
        "Layer with mixed berries and nuts on top.",
        "Store in the refrigerator until ready to eat."
      ],
      "benefits": "Chia seeds are packed with fiber, protein, and omega-3 fatty acids, providing sustained energy. Berries offer antioxidants, while nuts give healthy fats and additional protein, making this snack balanced and satisfying.",
      "generatedAt": "2025-09-27T19:01:51.991Z",
      "id": "1758999711991",
      "isAIGenerated": true,
      "responseTimeMs": 111901
    },
    {
      "name": "Apple Slices with Almond Butter",
      "type": "snack",
      "ingredients": [
        "1 medium apple",
        "2 tablespoons almond butter"
      ],
      "prepTime": "5 minutes",
      "calories": "220",
      "description": "A simple and delicious snack featuring apple slices paired with almond butter for a satisfying and nutritious treat.",
      "instructions": [
        "Wash and core the apple.",
        "Slice the apple into even pieces.",
        "Place the almond butter in a small container or wrap it in parchment paper.",
        "Serve apple slices with almond butter for dipping."
      ],
      "benefits": "This snack provides a balanced mix of carbohydrates, protein, and healthy fats, making it ideal for sustained energy. The fiber from the apple helps keep you full, while the almond butter offers protein and healthy fats for a steady energy release. It's quick to prepare, portable, and perfect for busy schedules.",
      "generatedAt": "2025-09-28T19:01:34.587Z",
      "id": "1759086094587",
      "isAIGenerated": true,
      "responseTimeMs": 94238
    }
  ],
  "lastGenerated": "2025-09-28T19:01:34.587Z"
}